Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x89d (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x2883a): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x7213e): ../Core/Src/adc.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x48793): /home/robotica8/STM32CubeIDE/workspace_1.8.0/learning_uROS/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x4d0cd): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x2cc69): __uint8_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)

 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0x7e1bd): __uint16_t
    <4f>   DW_AT_decl_file   : 2
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0x32a4a): short unsigned int
 <1><5d>: Abbrev Number: 3 (DW_TAG_typedef)
    <5e>   DW_AT_name        : (indirect string, offset: 0x5ee5c): __int32_t
    <62>   DW_AT_decl_file   : 2
    <63>   DW_AT_decl_line   : 77
    <64>   DW_AT_decl_column : 24
    <65>   DW_AT_type        : <0x69>
 <1><69>: Abbrev Number: 2 (DW_TAG_base_type)
    <6a>   DW_AT_byte_size   : 4
    <6b>   DW_AT_encoding    : 5	(signed)
    <6c>   DW_AT_name        : (indirect string, offset: 0xd46c): long int
 <1><70>: Abbrev Number: 3 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x61e0d): __uint32_t
    <75>   DW_AT_decl_file   : 2
    <76>   DW_AT_decl_line   : 79
    <77>   DW_AT_decl_column : 25
    <78>   DW_AT_type        : <0x7c>
 <1><7c>: Abbrev Number: 2 (DW_TAG_base_type)
    <7d>   DW_AT_byte_size   : 4
    <7e>   DW_AT_encoding    : 7	(unsigned)
    <7f>   DW_AT_name        : (indirect string, offset: 0x242e6): long unsigned int
 <1><83>: Abbrev Number: 2 (DW_TAG_base_type)
    <84>   DW_AT_byte_size   : 8
    <85>   DW_AT_encoding    : 5	(signed)
    <86>   DW_AT_name        : (indirect string, offset: 0x46ade): long long int
 <1><8a>: Abbrev Number: 2 (DW_TAG_base_type)
    <8b>   DW_AT_byte_size   : 8
    <8c>   DW_AT_encoding    : 7	(unsigned)
    <8d>   DW_AT_name        : (indirect string, offset: 0x1facf): long long unsigned int
 <1><91>: Abbrev Number: 4 (DW_TAG_base_type)
    <92>   DW_AT_byte_size   : 4
    <93>   DW_AT_encoding    : 5	(signed)
    <94>   DW_AT_name        : int
 <1><98>: Abbrev Number: 2 (DW_TAG_base_type)
    <99>   DW_AT_byte_size   : 4
    <9a>   DW_AT_encoding    : 7	(unsigned)
    <9b>   DW_AT_name        : (indirect string, offset: 0xcd19): unsigned int
 <1><9f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0>   DW_AT_name        : (indirect string, offset: 0x2cc6b): uint8_t
    <a4>   DW_AT_decl_file   : 3
    <a5>   DW_AT_decl_line   : 24
    <a6>   DW_AT_decl_column : 19
    <a7>   DW_AT_type        : <0x30>
 <1><ab>: Abbrev Number: 5 (DW_TAG_const_type)
    <ac>   DW_AT_type        : <0x9f>
 <1><b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1>   DW_AT_name        : (indirect string, offset: 0xa7ad5): uint16_t
    <b5>   DW_AT_decl_file   : 3
    <b6>   DW_AT_decl_line   : 36
    <b7>   DW_AT_decl_column : 20
    <b8>   DW_AT_type        : <0x4a>
 <1><bc>: Abbrev Number: 3 (DW_TAG_typedef)
    <bd>   DW_AT_name        : (indirect string, offset: 0x5ee5e): int32_t
    <c1>   DW_AT_decl_file   : 3
    <c2>   DW_AT_decl_line   : 44
    <c3>   DW_AT_decl_column : 19
    <c4>   DW_AT_type        : <0x5d>
 <1><c8>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <c9>   DW_AT_type        : <0xbc>
 <1><cd>: Abbrev Number: 3 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0xa7a15): uint32_t
    <d2>   DW_AT_decl_file   : 3
    <d3>   DW_AT_decl_line   : 48
    <d4>   DW_AT_decl_column : 20
    <d5>   DW_AT_type        : <0x70>
 <1><d9>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <da>   DW_AT_type        : <0xcd>
 <1><de>: Abbrev Number: 7 (DW_TAG_variable)
    <df>   DW_AT_name        : (indirect string, offset: 0x38ae): ITM_RxBuffer
    <e3>   DW_AT_decl_file   : 4
    <e4>   DW_AT_decl_line   : 1864
    <e6>   DW_AT_decl_column : 25
    <e7>   DW_AT_type        : <0xc8>
    <eb>   DW_AT_external    : 1
    <eb>   DW_AT_declaration : 1
 <1><eb>: Abbrev Number: 8 (DW_TAG_variable)
    <ec>   DW_AT_name        : (indirect string, offset: 0x73fee): SystemCoreClock
    <f0>   DW_AT_decl_file   : 5
    <f1>   DW_AT_decl_line   : 51
    <f2>   DW_AT_decl_column : 17
    <f3>   DW_AT_type        : <0xcd>
    <f7>   DW_AT_external    : 1
    <f7>   DW_AT_declaration : 1
 <1><f7>: Abbrev Number: 9 (DW_TAG_array_type)
    <f8>   DW_AT_type        : <0xab>
    <fc>   DW_AT_sibling     : <0x107>
 <2><100>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <101>   DW_AT_type        : <0x98>
    <105>   DW_AT_upper_bound : 15
 <2><106>: Abbrev Number: 0
 <1><107>: Abbrev Number: 5 (DW_TAG_const_type)
    <108>   DW_AT_type        : <0xf7>
 <1><10c>: Abbrev Number: 8 (DW_TAG_variable)
    <10d>   DW_AT_name        : (indirect string, offset: 0x8b74b): AHBPrescTable
    <111>   DW_AT_decl_file   : 5
    <112>   DW_AT_decl_line   : 52
    <113>   DW_AT_decl_column : 23
    <114>   DW_AT_type        : <0x107>
    <118>   DW_AT_external    : 1
    <118>   DW_AT_declaration : 1
 <1><118>: Abbrev Number: 9 (DW_TAG_array_type)
    <119>   DW_AT_type        : <0xab>
    <11d>   DW_AT_sibling     : <0x128>
 <2><121>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <122>   DW_AT_type        : <0x98>
    <126>   DW_AT_upper_bound : 7
 <2><127>: Abbrev Number: 0
 <1><128>: Abbrev Number: 5 (DW_TAG_const_type)
    <129>   DW_AT_type        : <0x118>
 <1><12d>: Abbrev Number: 8 (DW_TAG_variable)
    <12e>   DW_AT_name        : (indirect string, offset: 0x628e0): APBPrescTable
    <132>   DW_AT_decl_file   : 5
    <133>   DW_AT_decl_line   : 53
    <134>   DW_AT_decl_column : 23
    <135>   DW_AT_type        : <0x128>
    <139>   DW_AT_external    : 1
    <139>   DW_AT_declaration : 1
 <1><139>: Abbrev Number: 11 (DW_TAG_structure_type)
    <13a>   DW_AT_byte_size   : 80
    <13b>   DW_AT_decl_file   : 6
    <13c>   DW_AT_decl_line   : 161
    <13d>   DW_AT_decl_column : 9
    <13e>   DW_AT_sibling     : <0x245>
 <2><142>: Abbrev Number: 12 (DW_TAG_member)
    <143>   DW_AT_name        : SR
    <146>   DW_AT_decl_file   : 6
    <147>   DW_AT_decl_line   : 163
    <148>   DW_AT_decl_column : 17
    <149>   DW_AT_type        : <0xd9>
    <14d>   DW_AT_data_member_location: 0
 <2><14e>: Abbrev Number: 12 (DW_TAG_member)
    <14f>   DW_AT_name        : CR1
    <153>   DW_AT_decl_file   : 6
    <154>   DW_AT_decl_line   : 164
    <155>   DW_AT_decl_column : 17
    <156>   DW_AT_type        : <0xd9>
    <15a>   DW_AT_data_member_location: 4
 <2><15b>: Abbrev Number: 12 (DW_TAG_member)
    <15c>   DW_AT_name        : CR2
    <160>   DW_AT_decl_file   : 6
    <161>   DW_AT_decl_line   : 165
    <162>   DW_AT_decl_column : 17
    <163>   DW_AT_type        : <0xd9>
    <167>   DW_AT_data_member_location: 8
 <2><168>: Abbrev Number: 13 (DW_TAG_member)
    <169>   DW_AT_name        : (indirect string, offset: 0x8a3b5): SMPR1
    <16d>   DW_AT_decl_file   : 6
    <16e>   DW_AT_decl_line   : 166
    <16f>   DW_AT_decl_column : 17
    <170>   DW_AT_type        : <0xd9>
    <174>   DW_AT_data_member_location: 12
 <2><175>: Abbrev Number: 13 (DW_TAG_member)
    <176>   DW_AT_name        : (indirect string, offset: 0x376d4): SMPR2
    <17a>   DW_AT_decl_file   : 6
    <17b>   DW_AT_decl_line   : 167
    <17c>   DW_AT_decl_column : 17
    <17d>   DW_AT_type        : <0xd9>
    <181>   DW_AT_data_member_location: 16
 <2><182>: Abbrev Number: 13 (DW_TAG_member)
    <183>   DW_AT_name        : (indirect string, offset: 0x357fe): JOFR1
    <187>   DW_AT_decl_file   : 6
    <188>   DW_AT_decl_line   : 168
    <189>   DW_AT_decl_column : 17
    <18a>   DW_AT_type        : <0xd9>
    <18e>   DW_AT_data_member_location: 20
 <2><18f>: Abbrev Number: 13 (DW_TAG_member)
    <190>   DW_AT_name        : (indirect string, offset: 0x35804): JOFR2
    <194>   DW_AT_decl_file   : 6
    <195>   DW_AT_decl_line   : 169
    <196>   DW_AT_decl_column : 17
    <197>   DW_AT_type        : <0xd9>
    <19b>   DW_AT_data_member_location: 24
 <2><19c>: Abbrev Number: 13 (DW_TAG_member)
    <19d>   DW_AT_name        : (indirect string, offset: 0x3580a): JOFR3
    <1a1>   DW_AT_decl_file   : 6
    <1a2>   DW_AT_decl_line   : 170
    <1a3>   DW_AT_decl_column : 17
    <1a4>   DW_AT_type        : <0xd9>
    <1a8>   DW_AT_data_member_location: 28
 <2><1a9>: Abbrev Number: 13 (DW_TAG_member)
    <1aa>   DW_AT_name        : (indirect string, offset: 0x35810): JOFR4
    <1ae>   DW_AT_decl_file   : 6
    <1af>   DW_AT_decl_line   : 171
    <1b0>   DW_AT_decl_column : 17
    <1b1>   DW_AT_type        : <0xd9>
    <1b5>   DW_AT_data_member_location: 32
 <2><1b6>: Abbrev Number: 12 (DW_TAG_member)
    <1b7>   DW_AT_name        : HTR
    <1bb>   DW_AT_decl_file   : 6
    <1bc>   DW_AT_decl_line   : 172
    <1bd>   DW_AT_decl_column : 17
    <1be>   DW_AT_type        : <0xd9>
    <1c2>   DW_AT_data_member_location: 36
 <2><1c3>: Abbrev Number: 12 (DW_TAG_member)
    <1c4>   DW_AT_name        : LTR
    <1c8>   DW_AT_decl_file   : 6
    <1c9>   DW_AT_decl_line   : 173
    <1ca>   DW_AT_decl_column : 17
    <1cb>   DW_AT_type        : <0xd9>
    <1cf>   DW_AT_data_member_location: 40
 <2><1d0>: Abbrev Number: 13 (DW_TAG_member)
    <1d1>   DW_AT_name        : (indirect string, offset: 0xd594): SQR1
    <1d5>   DW_AT_decl_file   : 6
    <1d6>   DW_AT_decl_line   : 174
    <1d7>   DW_AT_decl_column : 17
    <1d8>   DW_AT_type        : <0xd9>
    <1dc>   DW_AT_data_member_location: 44
 <2><1dd>: Abbrev Number: 13 (DW_TAG_member)
    <1de>   DW_AT_name        : (indirect string, offset: 0xbee5): SQR2
    <1e2>   DW_AT_decl_file   : 6
    <1e3>   DW_AT_decl_line   : 175
    <1e4>   DW_AT_decl_column : 17
    <1e5>   DW_AT_type        : <0xd9>
    <1e9>   DW_AT_data_member_location: 48
 <2><1ea>: Abbrev Number: 13 (DW_TAG_member)
    <1eb>   DW_AT_name        : (indirect string, offset: 0xbeea): SQR3
    <1ef>   DW_AT_decl_file   : 6
    <1f0>   DW_AT_decl_line   : 176
    <1f1>   DW_AT_decl_column : 17
    <1f2>   DW_AT_type        : <0xd9>
    <1f6>   DW_AT_data_member_location: 52
 <2><1f7>: Abbrev Number: 13 (DW_TAG_member)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x76d10): JSQR
    <1fc>   DW_AT_decl_file   : 6
    <1fd>   DW_AT_decl_line   : 177
    <1fe>   DW_AT_decl_column : 17
    <1ff>   DW_AT_type        : <0xd9>
    <203>   DW_AT_data_member_location: 56
 <2><204>: Abbrev Number: 13 (DW_TAG_member)
    <205>   DW_AT_name        : (indirect string, offset: 0x62933): JDR1
    <209>   DW_AT_decl_file   : 6
    <20a>   DW_AT_decl_line   : 178
    <20b>   DW_AT_decl_column : 17
    <20c>   DW_AT_type        : <0xd9>
    <210>   DW_AT_data_member_location: 60
 <2><211>: Abbrev Number: 13 (DW_TAG_member)
    <212>   DW_AT_name        : (indirect string, offset: 0x62938): JDR2
    <216>   DW_AT_decl_file   : 6
    <217>   DW_AT_decl_line   : 179
    <218>   DW_AT_decl_column : 17
    <219>   DW_AT_type        : <0xd9>
    <21d>   DW_AT_data_member_location: 64
 <2><21e>: Abbrev Number: 13 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0x6293d): JDR3
    <223>   DW_AT_decl_file   : 6
    <224>   DW_AT_decl_line   : 180
    <225>   DW_AT_decl_column : 17
    <226>   DW_AT_type        : <0xd9>
    <22a>   DW_AT_data_member_location: 68
 <2><22b>: Abbrev Number: 13 (DW_TAG_member)
    <22c>   DW_AT_name        : (indirect string, offset: 0x28ab3): JDR4
    <230>   DW_AT_decl_file   : 6
    <231>   DW_AT_decl_line   : 181
    <232>   DW_AT_decl_column : 17
    <233>   DW_AT_type        : <0xd9>
    <237>   DW_AT_data_member_location: 72
 <2><238>: Abbrev Number: 12 (DW_TAG_member)
    <239>   DW_AT_name        : DR
    <23c>   DW_AT_decl_file   : 6
    <23d>   DW_AT_decl_line   : 182
    <23e>   DW_AT_decl_column : 17
    <23f>   DW_AT_type        : <0xd9>
    <243>   DW_AT_data_member_location: 76
 <2><244>: Abbrev Number: 0
 <1><245>: Abbrev Number: 3 (DW_TAG_typedef)
    <246>   DW_AT_name        : (indirect string, offset: 0x76aee): ADC_TypeDef
    <24a>   DW_AT_decl_file   : 6
    <24b>   DW_AT_decl_line   : 183
    <24c>   DW_AT_decl_column : 3
    <24d>   DW_AT_type        : <0x139>
 <1><251>: Abbrev Number: 14 (DW_TAG_structure_type)
    <252>   DW_AT_byte_size   : 16
    <253>   DW_AT_decl_file   : 6
    <254>   DW_AT_decl_line   : 361
    <256>   DW_AT_decl_column : 9
    <257>   DW_AT_sibling     : <0x294>
 <2><25b>: Abbrev Number: 15 (DW_TAG_member)
    <25c>   DW_AT_name        : CCR
    <260>   DW_AT_decl_file   : 6
    <261>   DW_AT_decl_line   : 363
    <263>   DW_AT_decl_column : 17
    <264>   DW_AT_type        : <0xd9>
    <268>   DW_AT_data_member_location: 0
 <2><269>: Abbrev Number: 16 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x3b872): CNDTR
    <26e>   DW_AT_decl_file   : 6
    <26f>   DW_AT_decl_line   : 364
    <271>   DW_AT_decl_column : 17
    <272>   DW_AT_type        : <0xd9>
    <276>   DW_AT_data_member_location: 4
 <2><277>: Abbrev Number: 16 (DW_TAG_member)
    <278>   DW_AT_name        : (indirect string, offset: 0x94522): CPAR
    <27c>   DW_AT_decl_file   : 6
    <27d>   DW_AT_decl_line   : 365
    <27f>   DW_AT_decl_column : 17
    <280>   DW_AT_type        : <0xd9>
    <284>   DW_AT_data_member_location: 8
 <2><285>: Abbrev Number: 16 (DW_TAG_member)
    <286>   DW_AT_name        : (indirect string, offset: 0x55283): CMAR
    <28a>   DW_AT_decl_file   : 6
    <28b>   DW_AT_decl_line   : 366
    <28d>   DW_AT_decl_column : 17
    <28e>   DW_AT_type        : <0xd9>
    <292>   DW_AT_data_member_location: 12
 <2><293>: Abbrev Number: 0
 <1><294>: Abbrev Number: 17 (DW_TAG_typedef)
    <295>   DW_AT_name        : (indirect string, offset: 0x7d901): DMA_Channel_TypeDef
    <299>   DW_AT_decl_file   : 6
    <29a>   DW_AT_decl_line   : 367
    <29c>   DW_AT_decl_column : 3
    <29d>   DW_AT_type        : <0x251>
 <1><2a1>: Abbrev Number: 14 (DW_TAG_structure_type)
    <2a2>   DW_AT_byte_size   : 8
    <2a3>   DW_AT_decl_file   : 6
    <2a4>   DW_AT_decl_line   : 369
    <2a6>   DW_AT_decl_column : 9
    <2a7>   DW_AT_sibling     : <0x2c8>
 <2><2ab>: Abbrev Number: 15 (DW_TAG_member)
    <2ac>   DW_AT_name        : ISR
    <2b0>   DW_AT_decl_file   : 6
    <2b1>   DW_AT_decl_line   : 371
    <2b3>   DW_AT_decl_column : 17
    <2b4>   DW_AT_type        : <0xd9>
    <2b8>   DW_AT_data_member_location: 0
 <2><2b9>: Abbrev Number: 16 (DW_TAG_member)
    <2ba>   DW_AT_name        : (indirect string, offset: 0x6ba3b): IFCR
    <2be>   DW_AT_decl_file   : 6
    <2bf>   DW_AT_decl_line   : 372
    <2c1>   DW_AT_decl_column : 17
    <2c2>   DW_AT_type        : <0xd9>
    <2c6>   DW_AT_data_member_location: 4
 <2><2c7>: Abbrev Number: 0
 <1><2c8>: Abbrev Number: 17 (DW_TAG_typedef)
    <2c9>   DW_AT_name        : (indirect string, offset: 0x38217): DMA_TypeDef
    <2cd>   DW_AT_decl_file   : 6
    <2ce>   DW_AT_decl_line   : 373
    <2d0>   DW_AT_decl_column : 3
    <2d1>   DW_AT_type        : <0x2a1>
 <1><2d5>: Abbrev Number: 14 (DW_TAG_structure_type)
    <2d6>   DW_AT_byte_size   : 28
    <2d7>   DW_AT_decl_file   : 6
    <2d8>   DW_AT_decl_line   : 481
    <2da>   DW_AT_decl_column : 9
    <2db>   DW_AT_sibling     : <0x342>
 <2><2df>: Abbrev Number: 15 (DW_TAG_member)
    <2e0>   DW_AT_name        : CRL
    <2e4>   DW_AT_decl_file   : 6
    <2e5>   DW_AT_decl_line   : 483
    <2e7>   DW_AT_decl_column : 17
    <2e8>   DW_AT_type        : <0xd9>
    <2ec>   DW_AT_data_member_location: 0
 <2><2ed>: Abbrev Number: 15 (DW_TAG_member)
    <2ee>   DW_AT_name        : CRH
    <2f2>   DW_AT_decl_file   : 6
    <2f3>   DW_AT_decl_line   : 484
    <2f5>   DW_AT_decl_column : 17
    <2f6>   DW_AT_type        : <0xd9>
    <2fa>   DW_AT_data_member_location: 4
 <2><2fb>: Abbrev Number: 15 (DW_TAG_member)
    <2fc>   DW_AT_name        : IDR
    <300>   DW_AT_decl_file   : 6
    <301>   DW_AT_decl_line   : 485
    <303>   DW_AT_decl_column : 17
    <304>   DW_AT_type        : <0xd9>
    <308>   DW_AT_data_member_location: 8
 <2><309>: Abbrev Number: 15 (DW_TAG_member)
    <30a>   DW_AT_name        : ODR
    <30e>   DW_AT_decl_file   : 6
    <30f>   DW_AT_decl_line   : 486
    <311>   DW_AT_decl_column : 17
    <312>   DW_AT_type        : <0xd9>
    <316>   DW_AT_data_member_location: 12
 <2><317>: Abbrev Number: 16 (DW_TAG_member)
    <318>   DW_AT_name        : (indirect string, offset: 0x22819): BSRR
    <31c>   DW_AT_decl_file   : 6
    <31d>   DW_AT_decl_line   : 487
    <31f>   DW_AT_decl_column : 17
    <320>   DW_AT_type        : <0xd9>
    <324>   DW_AT_data_member_location: 16
 <2><325>: Abbrev Number: 15 (DW_TAG_member)
    <326>   DW_AT_name        : BRR
    <32a>   DW_AT_decl_file   : 6
    <32b>   DW_AT_decl_line   : 488
    <32d>   DW_AT_decl_column : 17
    <32e>   DW_AT_type        : <0xd9>
    <332>   DW_AT_data_member_location: 20
 <2><333>: Abbrev Number: 16 (DW_TAG_member)
    <334>   DW_AT_name        : (indirect string, offset: 0x84161): LCKR
    <338>   DW_AT_decl_file   : 6
    <339>   DW_AT_decl_line   : 489
    <33b>   DW_AT_decl_column : 17
    <33c>   DW_AT_type        : <0xd9>
    <340>   DW_AT_data_member_location: 24
 <2><341>: Abbrev Number: 0
 <1><342>: Abbrev Number: 17 (DW_TAG_typedef)
    <343>   DW_AT_name        : (indirect string, offset: 0x950bf): GPIO_TypeDef
    <347>   DW_AT_decl_file   : 6
    <348>   DW_AT_decl_line   : 490
    <34a>   DW_AT_decl_column : 3
    <34b>   DW_AT_type        : <0x2d5>
 <1><34f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <350>   DW_AT_byte_size   : 40
    <351>   DW_AT_decl_file   : 6
    <352>   DW_AT_decl_line   : 547
    <354>   DW_AT_decl_column : 9
    <355>   DW_AT_sibling     : <0x3e5>
 <2><359>: Abbrev Number: 15 (DW_TAG_member)
    <35a>   DW_AT_name        : CR
    <35d>   DW_AT_decl_file   : 6
    <35e>   DW_AT_decl_line   : 549
    <360>   DW_AT_decl_column : 17
    <361>   DW_AT_type        : <0xd9>
    <365>   DW_AT_data_member_location: 0
 <2><366>: Abbrev Number: 16 (DW_TAG_member)
    <367>   DW_AT_name        : (indirect string, offset: 0x5d957): CFGR
    <36b>   DW_AT_decl_file   : 6
    <36c>   DW_AT_decl_line   : 550
    <36e>   DW_AT_decl_column : 17
    <36f>   DW_AT_type        : <0xd9>
    <373>   DW_AT_data_member_location: 4
 <2><374>: Abbrev Number: 15 (DW_TAG_member)
    <375>   DW_AT_name        : CIR
    <379>   DW_AT_decl_file   : 6
    <37a>   DW_AT_decl_line   : 551
    <37c>   DW_AT_decl_column : 17
    <37d>   DW_AT_type        : <0xd9>
    <381>   DW_AT_data_member_location: 8
 <2><382>: Abbrev Number: 16 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0x43321): APB2RSTR
    <387>   DW_AT_decl_file   : 6
    <388>   DW_AT_decl_line   : 552
    <38a>   DW_AT_decl_column : 17
    <38b>   DW_AT_type        : <0xd9>
    <38f>   DW_AT_data_member_location: 12
 <2><390>: Abbrev Number: 16 (DW_TAG_member)
    <391>   DW_AT_name        : (indirect string, offset: 0x11ad1): APB1RSTR
    <395>   DW_AT_decl_file   : 6
    <396>   DW_AT_decl_line   : 553
    <398>   DW_AT_decl_column : 17
    <399>   DW_AT_type        : <0xd9>
    <39d>   DW_AT_data_member_location: 16
 <2><39e>: Abbrev Number: 16 (DW_TAG_member)
    <39f>   DW_AT_name        : (indirect string, offset: 0xe360): AHBENR
    <3a3>   DW_AT_decl_file   : 6
    <3a4>   DW_AT_decl_line   : 554
    <3a6>   DW_AT_decl_column : 17
    <3a7>   DW_AT_type        : <0xd9>
    <3ab>   DW_AT_data_member_location: 20
 <2><3ac>: Abbrev Number: 16 (DW_TAG_member)
    <3ad>   DW_AT_name        : (indirect string, offset: 0x126d2): APB2ENR
    <3b1>   DW_AT_decl_file   : 6
    <3b2>   DW_AT_decl_line   : 555
    <3b4>   DW_AT_decl_column : 17
    <3b5>   DW_AT_type        : <0xd9>
    <3b9>   DW_AT_data_member_location: 24
 <2><3ba>: Abbrev Number: 16 (DW_TAG_member)
    <3bb>   DW_AT_name        : (indirect string, offset: 0x740b8): APB1ENR
    <3bf>   DW_AT_decl_file   : 6
    <3c0>   DW_AT_decl_line   : 556
    <3c2>   DW_AT_decl_column : 17
    <3c3>   DW_AT_type        : <0xd9>
    <3c7>   DW_AT_data_member_location: 28
 <2><3c8>: Abbrev Number: 16 (DW_TAG_member)
    <3c9>   DW_AT_name        : (indirect string, offset: 0x154f8): BDCR
    <3cd>   DW_AT_decl_file   : 6
    <3ce>   DW_AT_decl_line   : 557
    <3d0>   DW_AT_decl_column : 17
    <3d1>   DW_AT_type        : <0xd9>
    <3d5>   DW_AT_data_member_location: 32
 <2><3d6>: Abbrev Number: 15 (DW_TAG_member)
    <3d7>   DW_AT_name        : CSR
    <3db>   DW_AT_decl_file   : 6
    <3dc>   DW_AT_decl_line   : 558
    <3de>   DW_AT_decl_column : 17
    <3df>   DW_AT_type        : <0xd9>
    <3e3>   DW_AT_data_member_location: 36
 <2><3e4>: Abbrev Number: 0
 <1><3e5>: Abbrev Number: 17 (DW_TAG_typedef)
    <3e6>   DW_AT_name        : (indirect string, offset: 0x47983): RCC_TypeDef
    <3ea>   DW_AT_decl_file   : 6
    <3eb>   DW_AT_decl_line   : 561
    <3ed>   DW_AT_decl_column : 3
    <3ee>   DW_AT_type        : <0x34f>
 <1><3f2>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <3f3>   DW_AT_encoding    : 7	(unsigned)
    <3f4>   DW_AT_byte_size   : 1
    <3f5>   DW_AT_type        : <0x3c>
    <3f9>   DW_AT_decl_file   : 7
    <3fa>   DW_AT_decl_line   : 158
    <3fb>   DW_AT_decl_column : 1
    <3fc>   DW_AT_sibling     : <0x40d>
 <2><400>: Abbrev Number: 19 (DW_TAG_enumerator)
    <401>   DW_AT_name        : (indirect string, offset: 0x49073): DISABLE
    <405>   DW_AT_const_value : 0
 <2><406>: Abbrev Number: 19 (DW_TAG_enumerator)
    <407>   DW_AT_name        : (indirect string, offset: 0x8bdf4): ENABLE
    <40b>   DW_AT_const_value : 1
 <2><40c>: Abbrev Number: 0
 <1><40d>: Abbrev Number: 3 (DW_TAG_typedef)
    <40e>   DW_AT_name        : (indirect string, offset: 0x98c8a): FunctionalState
    <412>   DW_AT_decl_file   : 7
    <413>   DW_AT_decl_line   : 161
    <414>   DW_AT_decl_column : 3
    <415>   DW_AT_type        : <0x3f2>
 <1><419>: Abbrev Number: 2 (DW_TAG_base_type)
    <41a>   DW_AT_byte_size   : 8
    <41b>   DW_AT_encoding    : 4	(float)
    <41c>   DW_AT_name        : (indirect string, offset: 0xa0bd9): long double
 <1><420>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <421>   DW_AT_encoding    : 7	(unsigned)
    <422>   DW_AT_byte_size   : 1
    <423>   DW_AT_type        : <0x3c>
    <427>   DW_AT_decl_file   : 8
    <428>   DW_AT_decl_line   : 40
    <429>   DW_AT_decl_column : 1
    <42a>   DW_AT_sibling     : <0x447>
 <2><42e>: Abbrev Number: 19 (DW_TAG_enumerator)
    <42f>   DW_AT_name        : (indirect string, offset: 0x344a7): HAL_OK
    <433>   DW_AT_const_value : 0
 <2><434>: Abbrev Number: 19 (DW_TAG_enumerator)
    <435>   DW_AT_name        : (indirect string, offset: 0x603c9): HAL_ERROR
    <439>   DW_AT_const_value : 1
 <2><43a>: Abbrev Number: 19 (DW_TAG_enumerator)
    <43b>   DW_AT_name        : (indirect string, offset: 0x1ab9a): HAL_BUSY
    <43f>   DW_AT_const_value : 2
 <2><440>: Abbrev Number: 19 (DW_TAG_enumerator)
    <441>   DW_AT_name        : (indirect string, offset: 0x2d1cd): HAL_TIMEOUT
    <445>   DW_AT_const_value : 3
 <2><446>: Abbrev Number: 0
 <1><447>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <448>   DW_AT_encoding    : 7	(unsigned)
    <449>   DW_AT_byte_size   : 1
    <44a>   DW_AT_type        : <0x3c>
    <44e>   DW_AT_decl_file   : 8
    <44f>   DW_AT_decl_line   : 51
    <450>   DW_AT_decl_column : 1
    <451>   DW_AT_sibling     : <0x462>
 <2><455>: Abbrev Number: 19 (DW_TAG_enumerator)
    <456>   DW_AT_name        : (indirect string, offset: 0x71fe7): HAL_UNLOCKED
    <45a>   DW_AT_const_value : 0
 <2><45b>: Abbrev Number: 19 (DW_TAG_enumerator)
    <45c>   DW_AT_name        : (indirect string, offset: 0x998b7): HAL_LOCKED
    <460>   DW_AT_const_value : 1
 <2><461>: Abbrev Number: 0
 <1><462>: Abbrev Number: 3 (DW_TAG_typedef)
    <463>   DW_AT_name        : (indirect string, offset: 0x5aa83): HAL_LockTypeDef
    <467>   DW_AT_decl_file   : 8
    <468>   DW_AT_decl_line   : 54
    <469>   DW_AT_decl_column : 3
    <46a>   DW_AT_type        : <0x447>
 <1><46e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <46f>   DW_AT_byte_size   : 16
    <470>   DW_AT_decl_file   : 9
    <471>   DW_AT_decl_line   : 47
    <472>   DW_AT_decl_column : 9
    <473>   DW_AT_sibling     : <0x4ac>
 <2><477>: Abbrev Number: 12 (DW_TAG_member)
    <478>   DW_AT_name        : Pin
    <47c>   DW_AT_decl_file   : 9
    <47d>   DW_AT_decl_line   : 49
    <47e>   DW_AT_decl_column : 12
    <47f>   DW_AT_type        : <0xcd>
    <483>   DW_AT_data_member_location: 0
 <2><484>: Abbrev Number: 13 (DW_TAG_member)
    <485>   DW_AT_name        : (indirect string, offset: 0xafbbc): Mode
    <489>   DW_AT_decl_file   : 9
    <48a>   DW_AT_decl_line   : 52
    <48b>   DW_AT_decl_column : 12
    <48c>   DW_AT_type        : <0xcd>
    <490>   DW_AT_data_member_location: 4
 <2><491>: Abbrev Number: 13 (DW_TAG_member)
    <492>   DW_AT_name        : (indirect string, offset: 0x340b): Pull
    <496>   DW_AT_decl_file   : 9
    <497>   DW_AT_decl_line   : 55
    <498>   DW_AT_decl_column : 12
    <499>   DW_AT_type        : <0xcd>
    <49d>   DW_AT_data_member_location: 8
 <2><49e>: Abbrev Number: 13 (DW_TAG_member)
    <49f>   DW_AT_name        : (indirect string, offset: 0x5a253): Speed
    <4a3>   DW_AT_decl_file   : 9
    <4a4>   DW_AT_decl_line   : 58
    <4a5>   DW_AT_decl_column : 12
    <4a6>   DW_AT_type        : <0xcd>
    <4aa>   DW_AT_data_member_location: 12
 <2><4ab>: Abbrev Number: 0
 <1><4ac>: Abbrev Number: 3 (DW_TAG_typedef)
    <4ad>   DW_AT_name        : (indirect string, offset: 0x8da46): GPIO_InitTypeDef
    <4b1>   DW_AT_decl_file   : 9
    <4b2>   DW_AT_decl_line   : 60
    <4b3>   DW_AT_decl_column : 3
    <4b4>   DW_AT_type        : <0x46e>
 <1><4b8>: Abbrev Number: 11 (DW_TAG_structure_type)
    <4b9>   DW_AT_byte_size   : 28
    <4ba>   DW_AT_decl_file   : 10
    <4bb>   DW_AT_decl_line   : 48
    <4bc>   DW_AT_decl_column : 9
    <4bd>   DW_AT_sibling     : <0x51d>
 <2><4c1>: Abbrev Number: 13 (DW_TAG_member)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x39122): Direction
    <4c6>   DW_AT_decl_file   : 10
    <4c7>   DW_AT_decl_line   : 50
    <4c8>   DW_AT_decl_column : 12
    <4c9>   DW_AT_type        : <0xcd>
    <4cd>   DW_AT_data_member_location: 0
 <2><4ce>: Abbrev Number: 13 (DW_TAG_member)
    <4cf>   DW_AT_name        : (indirect string, offset: 0xa70d): PeriphInc
    <4d3>   DW_AT_decl_file   : 10
    <4d4>   DW_AT_decl_line   : 54
    <4d5>   DW_AT_decl_column : 12
    <4d6>   DW_AT_type        : <0xcd>
    <4da>   DW_AT_data_member_location: 4
 <2><4db>: Abbrev Number: 13 (DW_TAG_member)
    <4dc>   DW_AT_name        : (indirect string, offset: 0x17eb7): MemInc
    <4e0>   DW_AT_decl_file   : 10
    <4e1>   DW_AT_decl_line   : 57
    <4e2>   DW_AT_decl_column : 12
    <4e3>   DW_AT_type        : <0xcd>
    <4e7>   DW_AT_data_member_location: 8
 <2><4e8>: Abbrev Number: 13 (DW_TAG_member)
    <4e9>   DW_AT_name        : (indirect string, offset: 0x4c7a2): PeriphDataAlignment
    <4ed>   DW_AT_decl_file   : 10
    <4ee>   DW_AT_decl_line   : 60
    <4ef>   DW_AT_decl_column : 12
    <4f0>   DW_AT_type        : <0xcd>
    <4f4>   DW_AT_data_member_location: 12
 <2><4f5>: Abbrev Number: 13 (DW_TAG_member)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x8b0f8): MemDataAlignment
    <4fa>   DW_AT_decl_file   : 10
    <4fb>   DW_AT_decl_line   : 63
    <4fc>   DW_AT_decl_column : 12
    <4fd>   DW_AT_type        : <0xcd>
    <501>   DW_AT_data_member_location: 16
 <2><502>: Abbrev Number: 13 (DW_TAG_member)
    <503>   DW_AT_name        : (indirect string, offset: 0xafbbc): Mode
    <507>   DW_AT_decl_file   : 10
    <508>   DW_AT_decl_line   : 66
    <509>   DW_AT_decl_column : 12
    <50a>   DW_AT_type        : <0xcd>
    <50e>   DW_AT_data_member_location: 20
 <2><50f>: Abbrev Number: 13 (DW_TAG_member)
    <510>   DW_AT_name        : (indirect string, offset: 0xae977): Priority
    <514>   DW_AT_decl_file   : 10
    <515>   DW_AT_decl_line   : 71
    <516>   DW_AT_decl_column : 12
    <517>   DW_AT_type        : <0xcd>
    <51b>   DW_AT_data_member_location: 24
 <2><51c>: Abbrev Number: 0
 <1><51d>: Abbrev Number: 3 (DW_TAG_typedef)
    <51e>   DW_AT_name        : (indirect string, offset: 0x29034): DMA_InitTypeDef
    <522>   DW_AT_decl_file   : 10
    <523>   DW_AT_decl_line   : 73
    <524>   DW_AT_decl_column : 3
    <525>   DW_AT_type        : <0x4b8>
 <1><529>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <52a>   DW_AT_encoding    : 7	(unsigned)
    <52b>   DW_AT_byte_size   : 1
    <52c>   DW_AT_type        : <0x3c>
    <530>   DW_AT_decl_file   : 10
    <531>   DW_AT_decl_line   : 79
    <532>   DW_AT_decl_column : 1
    <533>   DW_AT_sibling     : <0x550>
 <2><537>: Abbrev Number: 19 (DW_TAG_enumerator)
    <538>   DW_AT_name        : (indirect string, offset: 0x730d2): HAL_DMA_STATE_RESET
    <53c>   DW_AT_const_value : 0
 <2><53d>: Abbrev Number: 19 (DW_TAG_enumerator)
    <53e>   DW_AT_name        : (indirect string, offset: 0x2a0dd): HAL_DMA_STATE_READY
    <542>   DW_AT_const_value : 1
 <2><543>: Abbrev Number: 19 (DW_TAG_enumerator)
    <544>   DW_AT_name        : (indirect string, offset: 0x6a82f): HAL_DMA_STATE_BUSY
    <548>   DW_AT_const_value : 2
 <2><549>: Abbrev Number: 19 (DW_TAG_enumerator)
    <54a>   DW_AT_name        : (indirect string, offset: 0x971dc): HAL_DMA_STATE_TIMEOUT
    <54e>   DW_AT_const_value : 3
 <2><54f>: Abbrev Number: 0
 <1><550>: Abbrev Number: 3 (DW_TAG_typedef)
    <551>   DW_AT_name        : (indirect string, offset: 0x54f06): HAL_DMA_StateTypeDef
    <555>   DW_AT_decl_file   : 10
    <556>   DW_AT_decl_line   : 84
    <557>   DW_AT_decl_column : 2
    <558>   DW_AT_type        : <0x529>
 <1><55c>: Abbrev Number: 20 (DW_TAG_structure_type)
    <55d>   DW_AT_name        : (indirect string, offset: 0x833ce): __DMA_HandleTypeDef
    <561>   DW_AT_byte_size   : 68
    <562>   DW_AT_decl_file   : 10
    <563>   DW_AT_decl_line   : 111
    <564>   DW_AT_decl_column : 16
    <565>   DW_AT_sibling     : <0x606>
 <2><569>: Abbrev Number: 13 (DW_TAG_member)
    <56a>   DW_AT_name        : (indirect string, offset: 0x3bfd3): Instance
    <56e>   DW_AT_decl_file   : 10
    <56f>   DW_AT_decl_line   : 113
    <570>   DW_AT_decl_column : 26
    <571>   DW_AT_type        : <0x606>
    <575>   DW_AT_data_member_location: 0
 <2><576>: Abbrev Number: 13 (DW_TAG_member)
    <577>   DW_AT_name        : (indirect string, offset: 0x2bb89): Init
    <57b>   DW_AT_decl_file   : 10
    <57c>   DW_AT_decl_line   : 115
    <57d>   DW_AT_decl_column : 25
    <57e>   DW_AT_type        : <0x51d>
    <582>   DW_AT_data_member_location: 4
 <2><583>: Abbrev Number: 13 (DW_TAG_member)
    <584>   DW_AT_name        : (indirect string, offset: 0x6da6c): Lock
    <588>   DW_AT_decl_file   : 10
    <589>   DW_AT_decl_line   : 117
    <58a>   DW_AT_decl_column : 25
    <58b>   DW_AT_type        : <0x462>
    <58f>   DW_AT_data_member_location: 32
 <2><590>: Abbrev Number: 13 (DW_TAG_member)
    <591>   DW_AT_name        : (indirect string, offset: 0xac535): State
    <595>   DW_AT_decl_file   : 10
    <596>   DW_AT_decl_line   : 119
    <597>   DW_AT_decl_column : 25
    <598>   DW_AT_type        : <0x550>
    <59c>   DW_AT_data_member_location: 33
 <2><59d>: Abbrev Number: 13 (DW_TAG_member)
    <59e>   DW_AT_name        : (indirect string, offset: 0x7082): Parent
    <5a2>   DW_AT_decl_file   : 10
    <5a3>   DW_AT_decl_line   : 121
    <5a4>   DW_AT_decl_column : 26
    <5a5>   DW_AT_type        : <0x60c>
    <5a9>   DW_AT_data_member_location: 36
 <2><5aa>: Abbrev Number: 13 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x98e69): XferCpltCallback
    <5af>   DW_AT_decl_file   : 10
    <5b0>   DW_AT_decl_line   : 123
    <5b1>   DW_AT_decl_column : 28
    <5b2>   DW_AT_type        : <0x61f>
    <5b6>   DW_AT_data_member_location: 40
 <2><5b7>: Abbrev Number: 13 (DW_TAG_member)
    <5b8>   DW_AT_name        : (indirect string, offset: 0x78205): XferHalfCpltCallback
    <5bc>   DW_AT_decl_file   : 10
    <5bd>   DW_AT_decl_line   : 125
    <5be>   DW_AT_decl_column : 28
    <5bf>   DW_AT_type        : <0x61f>
    <5c3>   DW_AT_data_member_location: 44
 <2><5c4>: Abbrev Number: 13 (DW_TAG_member)
    <5c5>   DW_AT_name        : (indirect string, offset: 0x1607d): XferErrorCallback
    <5c9>   DW_AT_decl_file   : 10
    <5ca>   DW_AT_decl_line   : 127
    <5cb>   DW_AT_decl_column : 28
    <5cc>   DW_AT_type        : <0x61f>
    <5d0>   DW_AT_data_member_location: 48
 <2><5d1>: Abbrev Number: 13 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0x53703): XferAbortCallback
    <5d6>   DW_AT_decl_file   : 10
    <5d7>   DW_AT_decl_line   : 129
    <5d8>   DW_AT_decl_column : 28
    <5d9>   DW_AT_type        : <0x61f>
    <5dd>   DW_AT_data_member_location: 52
 <2><5de>: Abbrev Number: 13 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0x9610f): ErrorCode
    <5e3>   DW_AT_decl_file   : 10
    <5e4>   DW_AT_decl_line   : 131
    <5e5>   DW_AT_decl_column : 25
    <5e6>   DW_AT_type        : <0xd9>
    <5ea>   DW_AT_data_member_location: 56
 <2><5eb>: Abbrev Number: 13 (DW_TAG_member)
    <5ec>   DW_AT_name        : (indirect string, offset: 0x41cf7): DmaBaseAddress
    <5f0>   DW_AT_decl_file   : 10
    <5f1>   DW_AT_decl_line   : 133
    <5f2>   DW_AT_decl_column : 27
    <5f3>   DW_AT_type        : <0x625>
    <5f7>   DW_AT_data_member_location: 60
 <2><5f8>: Abbrev Number: 13 (DW_TAG_member)
    <5f9>   DW_AT_name        : (indirect string, offset: 0x1f851): ChannelIndex
    <5fd>   DW_AT_decl_file   : 10
    <5fe>   DW_AT_decl_line   : 135
    <5ff>   DW_AT_decl_column : 26
    <600>   DW_AT_type        : <0xcd>
    <604>   DW_AT_data_member_location: 64
 <2><605>: Abbrev Number: 0
 <1><606>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <607>   DW_AT_byte_size   : 4
    <608>   DW_AT_type        : <0x294>
 <1><60c>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <60d>   DW_AT_byte_size   : 4
 <1><60e>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <60f>   DW_AT_prototyped  : 1
    <60f>   DW_AT_sibling     : <0x619>
 <2><613>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <614>   DW_AT_type        : <0x619>
 <2><618>: Abbrev Number: 0
 <1><619>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <61a>   DW_AT_byte_size   : 4
    <61b>   DW_AT_type        : <0x55c>
 <1><61f>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <620>   DW_AT_byte_size   : 4
    <621>   DW_AT_type        : <0x60e>
 <1><625>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <626>   DW_AT_byte_size   : 4
    <627>   DW_AT_type        : <0x2c8>
 <1><62b>: Abbrev Number: 3 (DW_TAG_typedef)
    <62c>   DW_AT_name        : (indirect string, offset: 0x833d0): DMA_HandleTypeDef
    <630>   DW_AT_decl_file   : 10
    <631>   DW_AT_decl_line   : 137
    <632>   DW_AT_decl_column : 3
    <633>   DW_AT_type        : <0x55c>
 <1><637>: Abbrev Number: 11 (DW_TAG_structure_type)
    <638>   DW_AT_byte_size   : 28
    <639>   DW_AT_decl_file   : 11
    <63a>   DW_AT_decl_line   : 53
    <63b>   DW_AT_decl_column : 9
    <63c>   DW_AT_sibling     : <0x69c>
 <2><640>: Abbrev Number: 13 (DW_TAG_member)
    <641>   DW_AT_name        : (indirect string, offset: 0x21872): DataAlign
    <645>   DW_AT_decl_file   : 11
    <646>   DW_AT_decl_line   : 55
    <647>   DW_AT_decl_column : 12
    <648>   DW_AT_type        : <0xcd>
    <64c>   DW_AT_data_member_location: 0
 <2><64d>: Abbrev Number: 13 (DW_TAG_member)
    <64e>   DW_AT_name        : (indirect string, offset: 0x5cfac): ScanConvMode
    <652>   DW_AT_decl_file   : 11
    <653>   DW_AT_decl_line   : 58
    <654>   DW_AT_decl_column : 12
    <655>   DW_AT_type        : <0xcd>
    <659>   DW_AT_data_member_location: 4
 <2><65a>: Abbrev Number: 13 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0x40cda): ContinuousConvMode
    <65f>   DW_AT_decl_file   : 11
    <660>   DW_AT_decl_line   : 69
    <661>   DW_AT_decl_column : 19
    <662>   DW_AT_type        : <0x40d>
    <666>   DW_AT_data_member_location: 8
 <2><667>: Abbrev Number: 13 (DW_TAG_member)
    <668>   DW_AT_name        : (indirect string, offset: 0x5c4af): NbrOfConversion
    <66c>   DW_AT_decl_file   : 11
    <66d>   DW_AT_decl_line   : 72
    <66e>   DW_AT_decl_column : 12
    <66f>   DW_AT_type        : <0xcd>
    <673>   DW_AT_data_member_location: 12
 <2><674>: Abbrev Number: 13 (DW_TAG_member)
    <675>   DW_AT_name        : (indirect string, offset: 0x3b0d0): DiscontinuousConvMode
    <679>   DW_AT_decl_file   : 11
    <67a>   DW_AT_decl_line   : 75
    <67b>   DW_AT_decl_column : 20
    <67c>   DW_AT_type        : <0x40d>
    <680>   DW_AT_data_member_location: 16
 <2><681>: Abbrev Number: 13 (DW_TAG_member)
    <682>   DW_AT_name        : (indirect string, offset: 0x15f7f): NbrOfDiscConversion
    <686>   DW_AT_decl_file   : 11
    <687>   DW_AT_decl_line   : 79
    <688>   DW_AT_decl_column : 12
    <689>   DW_AT_type        : <0xcd>
    <68d>   DW_AT_data_member_location: 20
 <2><68e>: Abbrev Number: 13 (DW_TAG_member)
    <68f>   DW_AT_name        : (indirect string, offset: 0x72de3): ExternalTrigConv
    <693>   DW_AT_decl_file   : 11
    <694>   DW_AT_decl_line   : 82
    <695>   DW_AT_decl_column : 12
    <696>   DW_AT_type        : <0xcd>
    <69a>   DW_AT_data_member_location: 24
 <2><69b>: Abbrev Number: 0
 <1><69c>: Abbrev Number: 3 (DW_TAG_typedef)
    <69d>   DW_AT_name        : (indirect string, offset: 0x23ee8): ADC_InitTypeDef
    <6a1>   DW_AT_decl_file   : 11
    <6a2>   DW_AT_decl_line   : 86
    <6a3>   DW_AT_decl_column : 2
    <6a4>   DW_AT_type        : <0x637>
 <1><6a8>: Abbrev Number: 11 (DW_TAG_structure_type)
    <6a9>   DW_AT_byte_size   : 12
    <6aa>   DW_AT_decl_file   : 11
    <6ab>   DW_AT_decl_line   : 93
    <6ac>   DW_AT_decl_column : 9
    <6ad>   DW_AT_sibling     : <0x6d9>
 <2><6b1>: Abbrev Number: 13 (DW_TAG_member)
    <6b2>   DW_AT_name        : (indirect string, offset: 0xac164): Channel
    <6b6>   DW_AT_decl_file   : 11
    <6b7>   DW_AT_decl_line   : 95
    <6b8>   DW_AT_decl_column : 12
    <6b9>   DW_AT_type        : <0xcd>
    <6bd>   DW_AT_data_member_location: 0
 <2><6be>: Abbrev Number: 13 (DW_TAG_member)
    <6bf>   DW_AT_name        : (indirect string, offset: 0x2b139): Rank
    <6c3>   DW_AT_decl_file   : 11
    <6c4>   DW_AT_decl_line   : 102
    <6c5>   DW_AT_decl_column : 12
    <6c6>   DW_AT_type        : <0xcd>
    <6ca>   DW_AT_data_member_location: 4
 <2><6cb>: Abbrev Number: 13 (DW_TAG_member)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x63a97): SamplingTime
    <6d0>   DW_AT_decl_file   : 11
    <6d1>   DW_AT_decl_line   : 105
    <6d2>   DW_AT_decl_column : 12
    <6d3>   DW_AT_type        : <0xcd>
    <6d7>   DW_AT_data_member_location: 8
 <2><6d8>: Abbrev Number: 0
 <1><6d9>: Abbrev Number: 3 (DW_TAG_typedef)
    <6da>   DW_AT_name        : (indirect string, offset: 0x99263): ADC_ChannelConfTypeDef
    <6de>   DW_AT_decl_file   : 11
    <6df>   DW_AT_decl_line   : 114
    <6e0>   DW_AT_decl_column : 2
    <6e1>   DW_AT_type        : <0x6a8>
 <1><6e5>: Abbrev Number: 20 (DW_TAG_structure_type)
    <6e6>   DW_AT_name        : (indirect string, offset: 0x5647b): __ADC_HandleTypeDef
    <6ea>   DW_AT_byte_size   : 48
    <6eb>   DW_AT_decl_file   : 11
    <6ec>   DW_AT_decl_line   : 176
    <6ed>   DW_AT_decl_column : 16
    <6ee>   DW_AT_sibling     : <0x741>
 <2><6f2>: Abbrev Number: 13 (DW_TAG_member)
    <6f3>   DW_AT_name        : (indirect string, offset: 0x3bfd3): Instance
    <6f7>   DW_AT_decl_file   : 11
    <6f8>   DW_AT_decl_line   : 178
    <6f9>   DW_AT_decl_column : 34
    <6fa>   DW_AT_type        : <0x741>
    <6fe>   DW_AT_data_member_location: 0
 <2><6ff>: Abbrev Number: 13 (DW_TAG_member)
    <700>   DW_AT_name        : (indirect string, offset: 0x2bb89): Init
    <704>   DW_AT_decl_file   : 11
    <705>   DW_AT_decl_line   : 180
    <706>   DW_AT_decl_column : 33
    <707>   DW_AT_type        : <0x69c>
    <70b>   DW_AT_data_member_location: 4
 <2><70c>: Abbrev Number: 13 (DW_TAG_member)
    <70d>   DW_AT_name        : (indirect string, offset: 0x1dfa): DMA_Handle
    <711>   DW_AT_decl_file   : 11
    <712>   DW_AT_decl_line   : 182
    <713>   DW_AT_decl_column : 34
    <714>   DW_AT_type        : <0x747>
    <718>   DW_AT_data_member_location: 32
 <2><719>: Abbrev Number: 13 (DW_TAG_member)
    <71a>   DW_AT_name        : (indirect string, offset: 0x6da6c): Lock
    <71e>   DW_AT_decl_file   : 11
    <71f>   DW_AT_decl_line   : 184
    <720>   DW_AT_decl_column : 33
    <721>   DW_AT_type        : <0x462>
    <725>   DW_AT_data_member_location: 36
 <2><726>: Abbrev Number: 13 (DW_TAG_member)
    <727>   DW_AT_name        : (indirect string, offset: 0xac535): State
    <72b>   DW_AT_decl_file   : 11
    <72c>   DW_AT_decl_line   : 186
    <72d>   DW_AT_decl_column : 33
    <72e>   DW_AT_type        : <0xd9>
    <732>   DW_AT_data_member_location: 40
 <2><733>: Abbrev Number: 13 (DW_TAG_member)
    <734>   DW_AT_name        : (indirect string, offset: 0x9610f): ErrorCode
    <738>   DW_AT_decl_file   : 11
    <739>   DW_AT_decl_line   : 188
    <73a>   DW_AT_decl_column : 33
    <73b>   DW_AT_type        : <0xd9>
    <73f>   DW_AT_data_member_location: 44
 <2><740>: Abbrev Number: 0
 <1><741>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <742>   DW_AT_byte_size   : 4
    <743>   DW_AT_type        : <0x245>
 <1><747>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <748>   DW_AT_byte_size   : 4
    <749>   DW_AT_type        : <0x62b>
 <1><74d>: Abbrev Number: 3 (DW_TAG_typedef)
    <74e>   DW_AT_name        : (indirect string, offset: 0x5647d): ADC_HandleTypeDef
    <752>   DW_AT_decl_file   : 11
    <753>   DW_AT_decl_line   : 199
    <754>   DW_AT_decl_column : 2
    <755>   DW_AT_type        : <0x6e5>
 <1><759>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <75a>   DW_AT_encoding    : 7	(unsigned)
    <75b>   DW_AT_byte_size   : 1
    <75c>   DW_AT_type        : <0x3c>
    <760>   DW_AT_decl_file   : 12
    <761>   DW_AT_decl_line   : 50
    <762>   DW_AT_decl_column : 1
    <763>   DW_AT_sibling     : <0x780>
 <2><767>: Abbrev Number: 19 (DW_TAG_enumerator)
    <768>   DW_AT_name        : (indirect string, offset: 0x4ed2b): HAL_TICK_FREQ_10HZ
    <76c>   DW_AT_const_value : 100
 <2><76d>: Abbrev Number: 19 (DW_TAG_enumerator)
    <76e>   DW_AT_name        : (indirect string, offset: 0x39081): HAL_TICK_FREQ_100HZ
    <772>   DW_AT_const_value : 10
 <2><773>: Abbrev Number: 19 (DW_TAG_enumerator)
    <774>   DW_AT_name        : (indirect string, offset: 0x4802e): HAL_TICK_FREQ_1KHZ
    <778>   DW_AT_const_value : 1
 <2><779>: Abbrev Number: 19 (DW_TAG_enumerator)
    <77a>   DW_AT_name        : (indirect string, offset: 0x379a2): HAL_TICK_FREQ_DEFAULT
    <77e>   DW_AT_const_value : 1
 <2><77f>: Abbrev Number: 0
 <1><780>: Abbrev Number: 3 (DW_TAG_typedef)
    <781>   DW_AT_name        : (indirect string, offset: 0x79db4): HAL_TickFreqTypeDef
    <785>   DW_AT_decl_file   : 12
    <786>   DW_AT_decl_line   : 55
    <787>   DW_AT_decl_column : 3
    <788>   DW_AT_type        : <0x759>
 <1><78c>: Abbrev Number: 8 (DW_TAG_variable)
    <78d>   DW_AT_name        : (indirect string, offset: 0x71258): uwTick
    <791>   DW_AT_decl_file   : 12
    <792>   DW_AT_decl_line   : 60
    <793>   DW_AT_decl_column : 22
    <794>   DW_AT_type        : <0xd9>
    <798>   DW_AT_external    : 1
    <798>   DW_AT_declaration : 1
 <1><798>: Abbrev Number: 8 (DW_TAG_variable)
    <799>   DW_AT_name        : (indirect string, offset: 0x73bd0): uwTickPrio
    <79d>   DW_AT_decl_file   : 12
    <79e>   DW_AT_decl_line   : 61
    <79f>   DW_AT_decl_column : 17
    <7a0>   DW_AT_type        : <0xcd>
    <7a4>   DW_AT_external    : 1
    <7a4>   DW_AT_declaration : 1
 <1><7a4>: Abbrev Number: 8 (DW_TAG_variable)
    <7a5>   DW_AT_name        : (indirect string, offset: 0x8b2cc): uwTickFreq
    <7a9>   DW_AT_decl_file   : 12
    <7aa>   DW_AT_decl_line   : 62
    <7ab>   DW_AT_decl_column : 28
    <7ac>   DW_AT_type        : <0x780>
    <7b0>   DW_AT_external    : 1
    <7b0>   DW_AT_declaration : 1
 <1><7b0>: Abbrev Number: 8 (DW_TAG_variable)
    <7b1>   DW_AT_name        : (indirect string, offset: 0x3ee4d): hadc1
    <7b5>   DW_AT_decl_file   : 13
    <7b6>   DW_AT_decl_line   : 35
    <7b7>   DW_AT_decl_column : 26
    <7b8>   DW_AT_type        : <0x74d>
    <7bc>   DW_AT_external    : 1
    <7bc>   DW_AT_declaration : 1
 <1><7bc>: Abbrev Number: 25 (DW_TAG_variable)
    <7bd>   DW_AT_specification: <0x7b0>
    <7c1>   DW_AT_decl_file   : 1
    <7c2>   DW_AT_decl_line   : 27
    <7c3>   DW_AT_decl_column : 19
    <7c4>   DW_AT_location    : 5 byte block: 3 ac d 0 20 	(DW_OP_addr: 20000dac)
 <1><7ca>: Abbrev Number: 26 (DW_TAG_subprogram)
    <7cb>   DW_AT_external    : 1
    <7cb>   DW_AT_name        : (indirect string, offset: 0x8748): HAL_ADC_MspDeInit
    <7cf>   DW_AT_decl_file   : 1
    <7d0>   DW_AT_decl_line   : 128
    <7d1>   DW_AT_decl_column : 6
    <7d2>   DW_AT_prototyped  : 1
    <7d2>   DW_AT_low_pc      : 0x0
    <7d6>   DW_AT_high_pc     : 0x48
    <7da>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7dc>   DW_AT_GNU_all_tail_call_sites: 1
    <7dc>   DW_AT_sibling     : <0x7f0>
 <2><7e0>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <7e1>   DW_AT_name        : (indirect string, offset: 0x538b4): adcHandle
    <7e5>   DW_AT_decl_file   : 1
    <7e6>   DW_AT_decl_line   : 128
    <7e7>   DW_AT_decl_column : 43
    <7e8>   DW_AT_type        : <0x7f0>
    <7ec>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><7ef>: Abbrev Number: 0
 <1><7f0>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <7f1>   DW_AT_byte_size   : 4
    <7f2>   DW_AT_type        : <0x74d>
 <1><7f6>: Abbrev Number: 26 (DW_TAG_subprogram)
    <7f7>   DW_AT_external    : 1
    <7f7>   DW_AT_name        : (indirect string, offset: 0x134fb): HAL_ADC_MspInit
    <7fb>   DW_AT_decl_file   : 1
    <7fc>   DW_AT_decl_line   : 94
    <7fd>   DW_AT_decl_column : 6
    <7fe>   DW_AT_prototyped  : 1
    <7fe>   DW_AT_low_pc      : 0x8000314
    <802>   DW_AT_high_pc     : 0xa8
    <806>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <808>   DW_AT_GNU_all_tail_call_sites: 1
    <808>   DW_AT_sibling     : <0x87e>
 <2><80c>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <80d>   DW_AT_name        : (indirect string, offset: 0x538b4): adcHandle
    <811>   DW_AT_decl_file   : 1
    <812>   DW_AT_decl_line   : 94
    <813>   DW_AT_decl_column : 41
    <814>   DW_AT_type        : <0x7f0>
    <818>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><81b>: Abbrev Number: 28 (DW_TAG_variable)
    <81c>   DW_AT_name        : (indirect string, offset: 0xef6a): GPIO_InitStruct
    <820>   DW_AT_decl_file   : 1
    <821>   DW_AT_decl_line   : 97
    <822>   DW_AT_decl_column : 20
    <823>   DW_AT_type        : <0x4ac>
    <827>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><82a>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <82b>   DW_AT_low_pc      : 0x8000334
    <82f>   DW_AT_high_pc     : 0x18
    <833>   DW_AT_sibling     : <0x847>
 <3><837>: Abbrev Number: 28 (DW_TAG_variable)
    <838>   DW_AT_name        : (indirect string, offset: 0x401a7): tmpreg
    <83c>   DW_AT_decl_file   : 1
    <83d>   DW_AT_decl_line   : 104
    <83e>   DW_AT_decl_column : 5
    <83f>   DW_AT_type        : <0xd9>
    <843>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><846>: Abbrev Number: 0
 <2><847>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <848>   DW_AT_low_pc      : 0x800034c
    <84c>   DW_AT_high_pc     : 0x18
    <850>   DW_AT_sibling     : <0x864>
 <3><854>: Abbrev Number: 28 (DW_TAG_variable)
    <855>   DW_AT_name        : (indirect string, offset: 0x401a7): tmpreg
    <859>   DW_AT_decl_file   : 1
    <85a>   DW_AT_decl_line   : 106
    <85b>   DW_AT_decl_column : 5
    <85c>   DW_AT_type        : <0xd9>
    <860>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><863>: Abbrev Number: 0
 <2><864>: Abbrev Number: 30 (DW_TAG_lexical_block)
    <865>   DW_AT_low_pc      : 0x8000364
    <869>   DW_AT_high_pc     : 0x18
 <3><86d>: Abbrev Number: 28 (DW_TAG_variable)
    <86e>   DW_AT_name        : (indirect string, offset: 0x401a7): tmpreg
    <872>   DW_AT_decl_file   : 1
    <873>   DW_AT_decl_line   : 107
    <874>   DW_AT_decl_column : 5
    <875>   DW_AT_type        : <0xd9>
    <879>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><87c>: Abbrev Number: 0
 <2><87d>: Abbrev Number: 0
 <1><87e>: Abbrev Number: 31 (DW_TAG_subprogram)
    <87f>   DW_AT_external    : 1
    <87f>   DW_AT_name        : (indirect string, offset: 0x2bb81): MX_ADC1_Init
    <883>   DW_AT_decl_file   : 1
    <884>   DW_AT_decl_line   : 30
    <885>   DW_AT_decl_column : 6
    <886>   DW_AT_prototyped  : 1
    <886>   DW_AT_low_pc      : 0x8000240
    <88a>   DW_AT_high_pc     : 0xd4
    <88e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <890>   DW_AT_GNU_all_tail_call_sites: 1
 <2><890>: Abbrev Number: 28 (DW_TAG_variable)
    <891>   DW_AT_name        : (indirect string, offset: 0x929da): sConfig
    <895>   DW_AT_decl_file   : 1
    <896>   DW_AT_decl_line   : 37
    <897>   DW_AT_decl_column : 26
    <898>   DW_AT_type        : <0x6d9>
    <89c>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><89f>: Abbrev Number: 0
 <1><8a0>: Abbrev Number: 0
  Compilation Unit @ offset 0x8a1:
   Length:        0x982 (32-bit)
   Version:       4
   Abbrev Offset: 0x1bb
   Pointer Size:  4
 <0><8ac>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <8ad>   DW_AT_producer    : (indirect string, offset: 0x2883a): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <8b1>   DW_AT_language    : 12	(ANSI C99)
    <8b2>   DW_AT_name        : (indirect string, offset: 0x9a9d5): ../Core/Src/can.c
    <8b6>   DW_AT_comp_dir    : (indirect string, offset: 0x48793): /home/robotica8/STM32CubeIDE/workspace_1.8.0/learning_uROS/Debug
    <8ba>   DW_AT_ranges      : 0x20
    <8be>   DW_AT_low_pc      : 0x0
    <8c2>   DW_AT_stmt_list   : 0x779
    <8c6>   DW_AT_GNU_macros  : 0x187a2
 <1><8ca>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <8cb>   DW_AT_encoding    : 5	(signed)
    <8cc>   DW_AT_byte_size   : 1
    <8cd>   DW_AT_type        : <0xa77>
    <8d1>   DW_AT_decl_file   : 6
    <8d2>   DW_AT_decl_line   : 70
    <8d3>   DW_AT_decl_column : 1
    <8d4>   DW_AT_sibling     : <0xa77>
 <2><8d8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <8d9>   DW_AT_name        : (indirect string, offset: 0x9a90a): NonMaskableInt_IRQn
    <8dd>   DW_AT_const_value : -14
 <2><8de>: Abbrev Number: 3 (DW_TAG_enumerator)
    <8df>   DW_AT_name        : (indirect string, offset: 0x9a895): HardFault_IRQn
    <8e3>   DW_AT_const_value : -13
 <2><8e4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <8e5>   DW_AT_name        : (indirect string, offset: 0x9aa77): MemoryManagement_IRQn
    <8e9>   DW_AT_const_value : -12
 <2><8ea>: Abbrev Number: 3 (DW_TAG_enumerator)
    <8eb>   DW_AT_name        : (indirect string, offset: 0x9ac57): BusFault_IRQn
    <8ef>   DW_AT_const_value : -11
 <2><8f0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <8f1>   DW_AT_name        : (indirect string, offset: 0x9ab1d): UsageFault_IRQn
    <8f5>   DW_AT_const_value : -10
 <2><8f6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <8f7>   DW_AT_name        : (indirect string, offset: 0x9a81f): SVCall_IRQn
    <8fb>   DW_AT_const_value : -5
 <2><8fc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <8fd>   DW_AT_name        : (indirect string, offset: 0x9aa8d): DebugMonitor_IRQn
    <901>   DW_AT_const_value : -4
 <2><902>: Abbrev Number: 3 (DW_TAG_enumerator)
    <903>   DW_AT_name        : (indirect string, offset: 0x9aaef): PendSV_IRQn
    <907>   DW_AT_const_value : -2
 <2><908>: Abbrev Number: 3 (DW_TAG_enumerator)
    <909>   DW_AT_name        : (indirect string, offset: 0x9ac8c): SysTick_IRQn
    <90d>   DW_AT_const_value : -1
 <2><90e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <90f>   DW_AT_name        : (indirect string, offset: 0x9abbd): WWDG_IRQn
    <913>   DW_AT_const_value : 0
 <2><914>: Abbrev Number: 4 (DW_TAG_enumerator)
    <915>   DW_AT_name        : (indirect string, offset: 0x9a901): PVD_IRQn
    <919>   DW_AT_const_value : 1
 <2><91a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <91b>   DW_AT_name        : (indirect string, offset: 0x9a9ad): TAMPER_IRQn
    <91f>   DW_AT_const_value : 2
 <2><920>: Abbrev Number: 4 (DW_TAG_enumerator)
    <921>   DW_AT_name        : (indirect string, offset: 0x9aab1): RTC_IRQn
    <925>   DW_AT_const_value : 3
 <2><926>: Abbrev Number: 4 (DW_TAG_enumerator)
    <927>   DW_AT_name        : (indirect string, offset: 0x9a967): FLASH_IRQn
    <92b>   DW_AT_const_value : 4
 <2><92c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <92d>   DW_AT_name        : (indirect string, offset: 0x9ac4e): RCC_IRQn
    <931>   DW_AT_const_value : 5
 <2><932>: Abbrev Number: 4 (DW_TAG_enumerator)
    <933>   DW_AT_name        : (indirect string, offset: 0x9224c): EXTI0_IRQn
    <937>   DW_AT_const_value : 6
 <2><938>: Abbrev Number: 4 (DW_TAG_enumerator)
    <939>   DW_AT_name        : (indirect string, offset: 0x9ad74): EXTI1_IRQn
    <93d>   DW_AT_const_value : 7
 <2><93e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <93f>   DW_AT_name        : (indirect string, offset: 0x9aa1f): EXTI2_IRQn
    <943>   DW_AT_const_value : 8
 <2><944>: Abbrev Number: 4 (DW_TAG_enumerator)
    <945>   DW_AT_name        : (indirect string, offset: 0x9ac99): EXTI3_IRQn
    <949>   DW_AT_const_value : 9
 <2><94a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <94b>   DW_AT_name        : (indirect string, offset: 0x9a95c): EXTI4_IRQn
    <94f>   DW_AT_const_value : 10
 <2><950>: Abbrev Number: 4 (DW_TAG_enumerator)
    <951>   DW_AT_name        : (indirect string, offset: 0x9a98b): DMA1_Channel1_IRQn
    <955>   DW_AT_const_value : 11
 <2><956>: Abbrev Number: 4 (DW_TAG_enumerator)
    <957>   DW_AT_name        : (indirect string, offset: 0x9abe4): DMA1_Channel2_IRQn
    <95b>   DW_AT_const_value : 12
 <2><95c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <95d>   DW_AT_name        : (indirect string, offset: 0x9a8e0): DMA1_Channel3_IRQn
    <961>   DW_AT_const_value : 13
 <2><962>: Abbrev Number: 4 (DW_TAG_enumerator)
    <963>   DW_AT_name        : (indirect string, offset: 0x9ab2d): DMA1_Channel4_IRQn
    <967>   DW_AT_const_value : 14
 <2><968>: Abbrev Number: 4 (DW_TAG_enumerator)
    <969>   DW_AT_name        : (indirect string, offset: 0x9a82b): DMA1_Channel5_IRQn
    <96d>   DW_AT_const_value : 15
 <2><96e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <96f>   DW_AT_name        : (indirect string, offset: 0x9aa34): DMA1_Channel6_IRQn
    <973>   DW_AT_const_value : 16
 <2><974>: Abbrev Number: 4 (DW_TAG_enumerator)
    <975>   DW_AT_name        : (indirect string, offset: 0x9acde): DMA1_Channel7_IRQn
    <979>   DW_AT_const_value : 17
 <2><97a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <97b>   DW_AT_name        : (indirect string, offset: 0x519ff): ADC1_2_IRQn
    <97f>   DW_AT_const_value : 18
 <2><980>: Abbrev Number: 4 (DW_TAG_enumerator)
    <981>   DW_AT_name        : (indirect string, offset: 0x43d21): USB_HP_CAN1_TX_IRQn
    <985>   DW_AT_const_value : 19
 <2><986>: Abbrev Number: 4 (DW_TAG_enumerator)
    <987>   DW_AT_name        : (indirect string, offset: 0x94383): USB_LP_CAN1_RX0_IRQn
    <98b>   DW_AT_const_value : 20
 <2><98c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <98d>   DW_AT_name        : (indirect string, offset: 0x9aba4): CAN1_RX1_IRQn
    <991>   DW_AT_const_value : 21
 <2><992>: Abbrev Number: 4 (DW_TAG_enumerator)
    <993>   DW_AT_name        : (indirect string, offset: 0x9ab82): CAN1_SCE_IRQn
    <997>   DW_AT_const_value : 22
 <2><998>: Abbrev Number: 4 (DW_TAG_enumerator)
    <999>   DW_AT_name        : (indirect string, offset: 0x9acf1): EXTI9_5_IRQn
    <99d>   DW_AT_const_value : 23
 <2><99e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <99f>   DW_AT_name        : (indirect string, offset: 0x2a7d7): TIM1_BRK_IRQn
    <9a3>   DW_AT_const_value : 24
 <2><9a4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9a5>   DW_AT_name        : (indirect string, offset: 0x5b304): TIM1_UP_IRQn
    <9a9>   DW_AT_const_value : 25
 <2><9aa>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9ab>   DW_AT_name        : (indirect string, offset: 0x31b2c): TIM1_TRG_COM_IRQn
    <9af>   DW_AT_const_value : 26
 <2><9b0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9b1>   DW_AT_name        : (indirect string, offset: 0x9ac23): TIM1_CC_IRQn
    <9b5>   DW_AT_const_value : 27
 <2><9b6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9b7>   DW_AT_name        : (indirect string, offset: 0x9a8bb): TIM2_IRQn
    <9bb>   DW_AT_const_value : 28
 <2><9bc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9bd>   DW_AT_name        : (indirect string, offset: 0x9ab13): TIM3_IRQn
    <9c1>   DW_AT_const_value : 29
 <2><9c2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c3>   DW_AT_name        : (indirect string, offset: 0x9a9a3): TIM4_IRQn
    <9c7>   DW_AT_const_value : 30
 <2><9c8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c9>   DW_AT_name        : (indirect string, offset: 0x9a9e7): I2C1_EV_IRQn
    <9cd>   DW_AT_const_value : 31
 <2><9ce>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x9ab60): I2C1_ER_IRQn
    <9d3>   DW_AT_const_value : 32
 <2><9d4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9d5>   DW_AT_name        : (indirect string, offset: 0x9a8a4): I2C2_EV_IRQn
    <9d9>   DW_AT_const_value : 33
 <2><9da>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9db>   DW_AT_name        : (indirect string, offset: 0x9a9ff): I2C2_ER_IRQn
    <9df>   DW_AT_const_value : 34
 <2><9e0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9e1>   DW_AT_name        : (indirect string, offset: 0x9a8b1): SPI1_IRQn
    <9e5>   DW_AT_const_value : 35
 <2><9e6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9e7>   DW_AT_name        : (indirect string, offset: 0x9a8d6): SPI2_IRQn
    <9eb>   DW_AT_const_value : 36
 <2><9ec>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9ed>   DW_AT_name        : (indirect string, offset: 0x9ac65): USART1_IRQn
    <9f1>   DW_AT_const_value : 37
 <2><9f2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9f3>   DW_AT_name        : (indirect string, offset: 0x9a97f): USART2_IRQn
    <9f7>   DW_AT_const_value : 38
 <2><9f8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9f9>   DW_AT_name        : (indirect string, offset: 0x9abd2): USART3_IRQn
    <9fd>   DW_AT_const_value : 39
 <2><9fe>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9ff>   DW_AT_name        : (indirect string, offset: 0x9aca4): EXTI15_10_IRQn
    <a03>   DW_AT_const_value : 40
 <2><a04>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a05>   DW_AT_name        : (indirect string, offset: 0x9acb3): RTC_Alarm_IRQn
    <a09>   DW_AT_const_value : 41
 <2><a0a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a0b>   DW_AT_name        : (indirect string, offset: 0x94b8f): USBWakeUp_IRQn
    <a0f>   DW_AT_const_value : 42
 <2><a10>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a11>   DW_AT_name        : (indirect string, offset: 0x709fa): TIM8_BRK_IRQn
    <a15>   DW_AT_const_value : 43
 <2><a16>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a17>   DW_AT_name        : (indirect string, offset: 0x4e1bc): TIM8_UP_IRQn
    <a1b>   DW_AT_const_value : 44
 <2><a1c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a1d>   DW_AT_name        : (indirect string, offset: 0x96885): TIM8_TRG_COM_IRQn
    <a21>   DW_AT_const_value : 45
 <2><a22>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a23>   DW_AT_name        : (indirect string, offset: 0x9ac01): TIM8_CC_IRQn
    <a27>   DW_AT_const_value : 46
 <2><a28>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a29>   DW_AT_name        : (indirect string, offset: 0x9abf7): ADC3_IRQn
    <a2d>   DW_AT_const_value : 47
 <2><a2e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a2f>   DW_AT_name        : (indirect string, offset: 0x9a87b): FSMC_IRQn
    <a33>   DW_AT_const_value : 48
 <2><a34>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a35>   DW_AT_name        : (indirect string, offset: 0x9aaba): SDIO_IRQn
    <a39>   DW_AT_const_value : 49
 <2><a3a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x9aa2a): TIM5_IRQn
    <a3f>   DW_AT_const_value : 50
 <2><a40>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a41>   DW_AT_name        : (indirect string, offset: 0x9ad84): SPI3_IRQn
    <a45>   DW_AT_const_value : 51
 <2><a46>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a47>   DW_AT_name        : (indirect string, offset: 0x9abc7): UART4_IRQn
    <a4b>   DW_AT_const_value : 52
 <2><a4c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a4d>   DW_AT_name        : (indirect string, offset: 0x9a885): UART5_IRQn
    <a51>   DW_AT_const_value : 53
 <2><a52>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a53>   DW_AT_name        : (indirect string, offset: 0x81cb3): TIM6_IRQn
    <a57>   DW_AT_const_value : 54
 <2><a58>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a59>   DW_AT_name        : (indirect string, offset: 0x9a9cb): TIM7_IRQn
    <a5d>   DW_AT_const_value : 55
 <2><a5e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a5f>   DW_AT_name        : (indirect string, offset: 0x9aadc): DMA2_Channel1_IRQn
    <a63>   DW_AT_const_value : 56
 <2><a64>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a65>   DW_AT_name        : (indirect string, offset: 0x9ad61): DMA2_Channel2_IRQn
    <a69>   DW_AT_const_value : 57
 <2><a6a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a6b>   DW_AT_name        : (indirect string, offset: 0x9aa0c): DMA2_Channel3_IRQn
    <a6f>   DW_AT_const_value : 58
 <2><a70>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a71>   DW_AT_name        : (indirect string, offset: 0x305c): DMA2_Channel4_5_IRQn
    <a75>   DW_AT_const_value : 59
 <2><a76>: Abbrev Number: 0
 <1><a77>: Abbrev Number: 5 (DW_TAG_base_type)
    <a78>   DW_AT_byte_size   : 1
    <a79>   DW_AT_encoding    : 6	(signed char)
    <a7a>   DW_AT_name        : (indirect string, offset: 0x4d0cd): signed char
 <1><a7e>: Abbrev Number: 6 (DW_TAG_typedef)
    <a7f>   DW_AT_name        : (indirect string, offset: 0x2cc69): __uint8_t
    <a83>   DW_AT_decl_file   : 2
    <a84>   DW_AT_decl_line   : 43
    <a85>   DW_AT_decl_column : 24
    <a86>   DW_AT_type        : <0xa8a>
 <1><a8a>: Abbrev Number: 5 (DW_TAG_base_type)
    <a8b>   DW_AT_byte_size   : 1
    <a8c>   DW_AT_encoding    : 8	(unsigned char)
    <a8d>   DW_AT_name        : (indirect string, offset: 0x1ef54): unsigned char
 <1><a91>: Abbrev Number: 5 (DW_TAG_base_type)
    <a92>   DW_AT_byte_size   : 2
    <a93>   DW_AT_encoding    : 5	(signed)
    <a94>   DW_AT_name        : (indirect string, offset: 0x72e03): short int
 <1><a98>: Abbrev Number: 6 (DW_TAG_typedef)
    <a99>   DW_AT_name        : (indirect string, offset: 0x7e1bd): __uint16_t
    <a9d>   DW_AT_decl_file   : 2
    <a9e>   DW_AT_decl_line   : 57
    <a9f>   DW_AT_decl_column : 25
    <aa0>   DW_AT_type        : <0xaa4>
 <1><aa4>: Abbrev Number: 5 (DW_TAG_base_type)
    <aa5>   DW_AT_byte_size   : 2
    <aa6>   DW_AT_encoding    : 7	(unsigned)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x32a4a): short unsigned int
 <1><aab>: Abbrev Number: 6 (DW_TAG_typedef)
    <aac>   DW_AT_name        : (indirect string, offset: 0x5ee5c): __int32_t
    <ab0>   DW_AT_decl_file   : 2
    <ab1>   DW_AT_decl_line   : 77
    <ab2>   DW_AT_decl_column : 24
    <ab3>   DW_AT_type        : <0xab7>
 <1><ab7>: Abbrev Number: 5 (DW_TAG_base_type)
    <ab8>   DW_AT_byte_size   : 4
    <ab9>   DW_AT_encoding    : 5	(signed)
    <aba>   DW_AT_name        : (indirect string, offset: 0xd46c): long int
 <1><abe>: Abbrev Number: 6 (DW_TAG_typedef)
    <abf>   DW_AT_name        : (indirect string, offset: 0x61e0d): __uint32_t
    <ac3>   DW_AT_decl_file   : 2
    <ac4>   DW_AT_decl_line   : 79
    <ac5>   DW_AT_decl_column : 25
    <ac6>   DW_AT_type        : <0xaca>
 <1><aca>: Abbrev Number: 5 (DW_TAG_base_type)
    <acb>   DW_AT_byte_size   : 4
    <acc>   DW_AT_encoding    : 7	(unsigned)
    <acd>   DW_AT_name        : (indirect string, offset: 0x242e6): long unsigned int
 <1><ad1>: Abbrev Number: 5 (DW_TAG_base_type)
    <ad2>   DW_AT_byte_size   : 8
    <ad3>   DW_AT_encoding    : 5	(signed)
    <ad4>   DW_AT_name        : (indirect string, offset: 0x46ade): long long int
 <1><ad8>: Abbrev Number: 5 (DW_TAG_base_type)
    <ad9>   DW_AT_byte_size   : 8
    <ada>   DW_AT_encoding    : 7	(unsigned)
    <adb>   DW_AT_name        : (indirect string, offset: 0x1facf): long long unsigned int
 <1><adf>: Abbrev Number: 7 (DW_TAG_base_type)
    <ae0>   DW_AT_byte_size   : 4
    <ae1>   DW_AT_encoding    : 5	(signed)
    <ae2>   DW_AT_name        : int
 <1><ae6>: Abbrev Number: 5 (DW_TAG_base_type)
    <ae7>   DW_AT_byte_size   : 4
    <ae8>   DW_AT_encoding    : 7	(unsigned)
    <ae9>   DW_AT_name        : (indirect string, offset: 0xcd19): unsigned int
 <1><aed>: Abbrev Number: 6 (DW_TAG_typedef)
    <aee>   DW_AT_name        : (indirect string, offset: 0x2cc6b): uint8_t
    <af2>   DW_AT_decl_file   : 3
    <af3>   DW_AT_decl_line   : 24
    <af4>   DW_AT_decl_column : 19
    <af5>   DW_AT_type        : <0xa7e>
 <1><af9>: Abbrev Number: 8 (DW_TAG_const_type)
    <afa>   DW_AT_type        : <0xaed>
 <1><afe>: Abbrev Number: 6 (DW_TAG_typedef)
    <aff>   DW_AT_name        : (indirect string, offset: 0xa7ad5): uint16_t
    <b03>   DW_AT_decl_file   : 3
    <b04>   DW_AT_decl_line   : 36
    <b05>   DW_AT_decl_column : 20
    <b06>   DW_AT_type        : <0xa98>
 <1><b0a>: Abbrev Number: 6 (DW_TAG_typedef)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x5ee5e): int32_t
    <b0f>   DW_AT_decl_file   : 3
    <b10>   DW_AT_decl_line   : 44
    <b11>   DW_AT_decl_column : 19
    <b12>   DW_AT_type        : <0xaab>
 <1><b16>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <b17>   DW_AT_type        : <0xb0a>
 <1><b1b>: Abbrev Number: 6 (DW_TAG_typedef)
    <b1c>   DW_AT_name        : (indirect string, offset: 0xa7a15): uint32_t
    <b20>   DW_AT_decl_file   : 3
    <b21>   DW_AT_decl_line   : 48
    <b22>   DW_AT_decl_column : 20
    <b23>   DW_AT_type        : <0xabe>
 <1><b27>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <b28>   DW_AT_type        : <0xb1b>
 <1><b2c>: Abbrev Number: 10 (DW_TAG_array_type)
    <b2d>   DW_AT_type        : <0xb1b>
    <b31>   DW_AT_sibling     : <0xb3c>
 <2><b35>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <b36>   DW_AT_type        : <0xae6>
    <b3a>   DW_AT_upper_bound : 7
 <2><b3b>: Abbrev Number: 0
 <1><b3c>: Abbrev Number: 12 (DW_TAG_variable)
    <b3d>   DW_AT_name        : (indirect string, offset: 0x38ae): ITM_RxBuffer
    <b41>   DW_AT_decl_file   : 4
    <b42>   DW_AT_decl_line   : 1864
    <b44>   DW_AT_decl_column : 25
    <b45>   DW_AT_type        : <0xb16>
    <b49>   DW_AT_external    : 1
    <b49>   DW_AT_declaration : 1
 <1><b49>: Abbrev Number: 13 (DW_TAG_variable)
    <b4a>   DW_AT_name        : (indirect string, offset: 0x73fee): SystemCoreClock
    <b4e>   DW_AT_decl_file   : 5
    <b4f>   DW_AT_decl_line   : 51
    <b50>   DW_AT_decl_column : 17
    <b51>   DW_AT_type        : <0xb1b>
    <b55>   DW_AT_external    : 1
    <b55>   DW_AT_declaration : 1
 <1><b55>: Abbrev Number: 10 (DW_TAG_array_type)
    <b56>   DW_AT_type        : <0xaf9>
    <b5a>   DW_AT_sibling     : <0xb65>
 <2><b5e>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <b5f>   DW_AT_type        : <0xae6>
    <b63>   DW_AT_upper_bound : 15
 <2><b64>: Abbrev Number: 0
 <1><b65>: Abbrev Number: 8 (DW_TAG_const_type)
    <b66>   DW_AT_type        : <0xb55>
 <1><b6a>: Abbrev Number: 13 (DW_TAG_variable)
    <b6b>   DW_AT_name        : (indirect string, offset: 0x8b74b): AHBPrescTable
    <b6f>   DW_AT_decl_file   : 5
    <b70>   DW_AT_decl_line   : 52
    <b71>   DW_AT_decl_column : 23
    <b72>   DW_AT_type        : <0xb65>
    <b76>   DW_AT_external    : 1
    <b76>   DW_AT_declaration : 1
 <1><b76>: Abbrev Number: 10 (DW_TAG_array_type)
    <b77>   DW_AT_type        : <0xaf9>
    <b7b>   DW_AT_sibling     : <0xb86>
 <2><b7f>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <b80>   DW_AT_type        : <0xae6>
    <b84>   DW_AT_upper_bound : 7
 <2><b85>: Abbrev Number: 0
 <1><b86>: Abbrev Number: 8 (DW_TAG_const_type)
    <b87>   DW_AT_type        : <0xb76>
 <1><b8b>: Abbrev Number: 13 (DW_TAG_variable)
    <b8c>   DW_AT_name        : (indirect string, offset: 0x628e0): APBPrescTable
    <b90>   DW_AT_decl_file   : 5
    <b91>   DW_AT_decl_line   : 53
    <b92>   DW_AT_decl_column : 23
    <b93>   DW_AT_type        : <0xb86>
    <b97>   DW_AT_external    : 1
    <b97>   DW_AT_declaration : 1
 <1><b97>: Abbrev Number: 14 (DW_TAG_structure_type)
    <b98>   DW_AT_byte_size   : 16
    <b99>   DW_AT_decl_file   : 6
    <b9a>   DW_AT_decl_line   : 253
    <b9b>   DW_AT_decl_column : 9
    <b9c>   DW_AT_sibling     : <0xbd8>
 <2><ba0>: Abbrev Number: 15 (DW_TAG_member)
    <ba1>   DW_AT_name        : TIR
    <ba5>   DW_AT_decl_file   : 6
    <ba6>   DW_AT_decl_line   : 255
    <ba7>   DW_AT_decl_column : 17
    <ba8>   DW_AT_type        : <0xb27>
    <bac>   DW_AT_data_member_location: 0
 <2><bad>: Abbrev Number: 16 (DW_TAG_member)
    <bae>   DW_AT_name        : (indirect string, offset: 0x9ad7f): TDTR
    <bb2>   DW_AT_decl_file   : 6
    <bb3>   DW_AT_decl_line   : 256
    <bb5>   DW_AT_decl_column : 17
    <bb6>   DW_AT_type        : <0xb27>
    <bba>   DW_AT_data_member_location: 4
 <2><bbb>: Abbrev Number: 16 (DW_TAG_member)
    <bbc>   DW_AT_name        : (indirect string, offset: 0x9aa5e): TDLR
    <bc0>   DW_AT_decl_file   : 6
    <bc1>   DW_AT_decl_line   : 257
    <bc3>   DW_AT_decl_column : 17
    <bc4>   DW_AT_type        : <0xb27>
    <bc8>   DW_AT_data_member_location: 8
 <2><bc9>: Abbrev Number: 16 (DW_TAG_member)
    <bca>   DW_AT_name        : (indirect string, offset: 0x9aa59): TDHR
    <bce>   DW_AT_decl_file   : 6
    <bcf>   DW_AT_decl_line   : 258
    <bd1>   DW_AT_decl_column : 17
    <bd2>   DW_AT_type        : <0xb27>
    <bd6>   DW_AT_data_member_location: 12
 <2><bd7>: Abbrev Number: 0
 <1><bd8>: Abbrev Number: 17 (DW_TAG_typedef)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x9ab4a): CAN_TxMailBox_TypeDef
    <bdd>   DW_AT_decl_file   : 6
    <bde>   DW_AT_decl_line   : 259
    <be0>   DW_AT_decl_column : 3
    <be1>   DW_AT_type        : <0xb97>
 <1><be5>: Abbrev Number: 18 (DW_TAG_structure_type)
    <be6>   DW_AT_byte_size   : 16
    <be7>   DW_AT_decl_file   : 6
    <be8>   DW_AT_decl_line   : 265
    <bea>   DW_AT_decl_column : 9
    <beb>   DW_AT_sibling     : <0xc28>
 <2><bef>: Abbrev Number: 19 (DW_TAG_member)
    <bf0>   DW_AT_name        : RIR
    <bf4>   DW_AT_decl_file   : 6
    <bf5>   DW_AT_decl_line   : 267
    <bf7>   DW_AT_decl_column : 17
    <bf8>   DW_AT_type        : <0xb27>
    <bfc>   DW_AT_data_member_location: 0
 <2><bfd>: Abbrev Number: 16 (DW_TAG_member)
    <bfe>   DW_AT_name        : (indirect string, offset: 0x9a8c5): RDTR
    <c02>   DW_AT_decl_file   : 6
    <c03>   DW_AT_decl_line   : 268
    <c05>   DW_AT_decl_column : 17
    <c06>   DW_AT_type        : <0xb27>
    <c0a>   DW_AT_data_member_location: 4
 <2><c0b>: Abbrev Number: 16 (DW_TAG_member)
    <c0c>   DW_AT_name        : (indirect string, offset: 0x9a890): RDLR
    <c10>   DW_AT_decl_file   : 6
    <c11>   DW_AT_decl_line   : 269
    <c13>   DW_AT_decl_column : 17
    <c14>   DW_AT_type        : <0xb27>
    <c18>   DW_AT_data_member_location: 8
 <2><c19>: Abbrev Number: 16 (DW_TAG_member)
    <c1a>   DW_AT_name        : (indirect string, offset: 0x9a91e): RDHR
    <c1e>   DW_AT_decl_file   : 6
    <c1f>   DW_AT_decl_line   : 270
    <c21>   DW_AT_decl_column : 17
    <c22>   DW_AT_type        : <0xb27>
    <c26>   DW_AT_data_member_location: 12
 <2><c27>: Abbrev Number: 0
 <1><c28>: Abbrev Number: 17 (DW_TAG_typedef)
    <c29>   DW_AT_name        : (indirect string, offset: 0x9aafb): CAN_FIFOMailBox_TypeDef
    <c2d>   DW_AT_decl_file   : 6
    <c2e>   DW_AT_decl_line   : 271
    <c30>   DW_AT_decl_column : 3
    <c31>   DW_AT_type        : <0xbe5>
 <1><c35>: Abbrev Number: 18 (DW_TAG_structure_type)
    <c36>   DW_AT_byte_size   : 8
    <c37>   DW_AT_decl_file   : 6
    <c38>   DW_AT_decl_line   : 277
    <c3a>   DW_AT_decl_column : 9
    <c3b>   DW_AT_sibling     : <0xc5c>
 <2><c3f>: Abbrev Number: 19 (DW_TAG_member)
    <c40>   DW_AT_name        : FR1
    <c44>   DW_AT_decl_file   : 6
    <c45>   DW_AT_decl_line   : 279
    <c47>   DW_AT_decl_column : 17
    <c48>   DW_AT_type        : <0xb27>
    <c4c>   DW_AT_data_member_location: 0
 <2><c4d>: Abbrev Number: 19 (DW_TAG_member)
    <c4e>   DW_AT_name        : FR2
    <c52>   DW_AT_decl_file   : 6
    <c53>   DW_AT_decl_line   : 280
    <c55>   DW_AT_decl_column : 17
    <c56>   DW_AT_type        : <0xb27>
    <c5a>   DW_AT_data_member_location: 4
 <2><c5b>: Abbrev Number: 0
 <1><c5c>: Abbrev Number: 17 (DW_TAG_typedef)
    <c5d>   DW_AT_name        : (indirect string, offset: 0x9ac71): CAN_FilterRegister_TypeDef
    <c61>   DW_AT_decl_file   : 6
    <c62>   DW_AT_decl_line   : 281
    <c64>   DW_AT_decl_column : 3
    <c65>   DW_AT_type        : <0xc35>
 <1><c69>: Abbrev Number: 20 (DW_TAG_structure_type)
    <c6a>   DW_AT_byte_size   : 688
    <c6c>   DW_AT_decl_file   : 6
    <c6d>   DW_AT_decl_line   : 287
    <c6f>   DW_AT_decl_column : 9
    <c70>   DW_AT_sibling     : <0xdb6>
 <2><c74>: Abbrev Number: 19 (DW_TAG_member)
    <c75>   DW_AT_name        : MCR
    <c79>   DW_AT_decl_file   : 6
    <c7a>   DW_AT_decl_line   : 289
    <c7c>   DW_AT_decl_column : 17
    <c7d>   DW_AT_type        : <0xb27>
    <c81>   DW_AT_data_member_location: 0
 <2><c82>: Abbrev Number: 19 (DW_TAG_member)
    <c83>   DW_AT_name        : MSR
    <c87>   DW_AT_decl_file   : 6
    <c88>   DW_AT_decl_line   : 290
    <c8a>   DW_AT_decl_column : 17
    <c8b>   DW_AT_type        : <0xb27>
    <c8f>   DW_AT_data_member_location: 4
 <2><c90>: Abbrev Number: 19 (DW_TAG_member)
    <c91>   DW_AT_name        : TSR
    <c95>   DW_AT_decl_file   : 6
    <c96>   DW_AT_decl_line   : 291
    <c98>   DW_AT_decl_column : 17
    <c99>   DW_AT_type        : <0xb27>
    <c9d>   DW_AT_data_member_location: 8
 <2><c9e>: Abbrev Number: 16 (DW_TAG_member)
    <c9f>   DW_AT_name        : (indirect string, offset: 0x9a99e): RF0R
    <ca3>   DW_AT_decl_file   : 6
    <ca4>   DW_AT_decl_line   : 292
    <ca6>   DW_AT_decl_column : 17
    <ca7>   DW_AT_type        : <0xb27>
    <cab>   DW_AT_data_member_location: 12
 <2><cac>: Abbrev Number: 16 (DW_TAG_member)
    <cad>   DW_AT_name        : (indirect string, offset: 0x9ab7d): RF1R
    <cb1>   DW_AT_decl_file   : 6
    <cb2>   DW_AT_decl_line   : 293
    <cb4>   DW_AT_decl_column : 17
    <cb5>   DW_AT_type        : <0xb27>
    <cb9>   DW_AT_data_member_location: 16
 <2><cba>: Abbrev Number: 19 (DW_TAG_member)
    <cbb>   DW_AT_name        : IER
    <cbf>   DW_AT_decl_file   : 6
    <cc0>   DW_AT_decl_line   : 294
    <cc2>   DW_AT_decl_column : 17
    <cc3>   DW_AT_type        : <0xb27>
    <cc7>   DW_AT_data_member_location: 20
 <2><cc8>: Abbrev Number: 19 (DW_TAG_member)
    <cc9>   DW_AT_name        : ESR
    <ccd>   DW_AT_decl_file   : 6
    <cce>   DW_AT_decl_line   : 295
    <cd0>   DW_AT_decl_column : 17
    <cd1>   DW_AT_type        : <0xb27>
    <cd5>   DW_AT_data_member_location: 24
 <2><cd6>: Abbrev Number: 19 (DW_TAG_member)
    <cd7>   DW_AT_name        : BTR
    <cdb>   DW_AT_decl_file   : 6
    <cdc>   DW_AT_decl_line   : 296
    <cde>   DW_AT_decl_column : 17
    <cdf>   DW_AT_type        : <0xb27>
    <ce3>   DW_AT_data_member_location: 28
 <2><ce4>: Abbrev Number: 16 (DW_TAG_member)
    <ce5>   DW_AT_name        : (indirect string, offset: 0x9ad2f): RESERVED0
    <ce9>   DW_AT_decl_file   : 6
    <cea>   DW_AT_decl_line   : 297
    <cec>   DW_AT_decl_column : 13
    <ced>   DW_AT_type        : <0xdb6>
    <cf1>   DW_AT_data_member_location: 32
 <2><cf2>: Abbrev Number: 21 (DW_TAG_member)
    <cf3>   DW_AT_name        : (indirect string, offset: 0x9a9f4): sTxMailBox
    <cf7>   DW_AT_decl_file   : 6
    <cf8>   DW_AT_decl_line   : 298
    <cfa>   DW_AT_decl_column : 25
    <cfb>   DW_AT_type        : <0xdc6>
    <cff>   DW_AT_data_member_location: 384
 <2><d01>: Abbrev Number: 21 (DW_TAG_member)
    <d02>   DW_AT_name        : (indirect string, offset: 0x9a972): sFIFOMailBox
    <d06>   DW_AT_decl_file   : 6
    <d07>   DW_AT_decl_line   : 299
    <d09>   DW_AT_decl_column : 27
    <d0a>   DW_AT_type        : <0xdd6>
    <d0e>   DW_AT_data_member_location: 432
 <2><d10>: Abbrev Number: 21 (DW_TAG_member)
    <d11>   DW_AT_name        : (indirect string, offset: 0x9ad39): RESERVED1
    <d15>   DW_AT_decl_file   : 6
    <d16>   DW_AT_decl_line   : 300
    <d18>   DW_AT_decl_column : 13
    <d19>   DW_AT_type        : <0xde6>
    <d1d>   DW_AT_data_member_location: 464
 <2><d1f>: Abbrev Number: 22 (DW_TAG_member)
    <d20>   DW_AT_name        : FMR
    <d24>   DW_AT_decl_file   : 6
    <d25>   DW_AT_decl_line   : 301
    <d27>   DW_AT_decl_column : 17
    <d28>   DW_AT_type        : <0xb27>
    <d2c>   DW_AT_data_member_location: 512
 <2><d2e>: Abbrev Number: 21 (DW_TAG_member)
    <d2f>   DW_AT_name        : (indirect string, offset: 0x9a859): FM1R
    <d33>   DW_AT_decl_file   : 6
    <d34>   DW_AT_decl_line   : 302
    <d36>   DW_AT_decl_column : 17
    <d37>   DW_AT_type        : <0xb27>
    <d3b>   DW_AT_data_member_location: 516
 <2><d3d>: Abbrev Number: 21 (DW_TAG_member)
    <d3e>   DW_AT_name        : (indirect string, offset: 0x9ad43): RESERVED2
    <d42>   DW_AT_decl_file   : 6
    <d43>   DW_AT_decl_line   : 303
    <d45>   DW_AT_decl_column : 13
    <d46>   DW_AT_type        : <0xb1b>
    <d4a>   DW_AT_data_member_location: 520
 <2><d4c>: Abbrev Number: 21 (DW_TAG_member)
    <d4d>   DW_AT_name        : (indirect string, offset: 0x9acfe): FS1R
    <d51>   DW_AT_decl_file   : 6
    <d52>   DW_AT_decl_line   : 304
    <d54>   DW_AT_decl_column : 17
    <d55>   DW_AT_type        : <0xb27>
    <d59>   DW_AT_data_member_location: 524
 <2><d5b>: Abbrev Number: 21 (DW_TAG_member)
    <d5c>   DW_AT_name        : (indirect string, offset: 0x9ad4d): RESERVED3
    <d60>   DW_AT_decl_file   : 6
    <d61>   DW_AT_decl_line   : 305
    <d63>   DW_AT_decl_column : 13
    <d64>   DW_AT_type        : <0xb1b>
    <d68>   DW_AT_data_member_location: 528
 <2><d6a>: Abbrev Number: 21 (DW_TAG_member)
    <d6b>   DW_AT_name        : (indirect string, offset: 0x9abde): FFA1R
    <d6f>   DW_AT_decl_file   : 6
    <d70>   DW_AT_decl_line   : 306
    <d72>   DW_AT_decl_column : 17
    <d73>   DW_AT_type        : <0xb27>
    <d77>   DW_AT_data_member_location: 532
 <2><d79>: Abbrev Number: 21 (DW_TAG_member)
    <d7a>   DW_AT_name        : (indirect string, offset: 0x9ab40): RESERVED4
    <d7e>   DW_AT_decl_file   : 6
    <d7f>   DW_AT_decl_line   : 307
    <d81>   DW_AT_decl_column : 13
    <d82>   DW_AT_type        : <0xb1b>
    <d86>   DW_AT_data_member_location: 536
 <2><d88>: Abbrev Number: 21 (DW_TAG_member)
    <d89>   DW_AT_name        : (indirect string, offset: 0x9abdf): FA1R
    <d8d>   DW_AT_decl_file   : 6
    <d8e>   DW_AT_decl_line   : 308
    <d90>   DW_AT_decl_column : 17
    <d91>   DW_AT_type        : <0xb27>
    <d95>   DW_AT_data_member_location: 540
 <2><d97>: Abbrev Number: 21 (DW_TAG_member)
    <d98>   DW_AT_name        : (indirect string, offset: 0x9ad57): RESERVED5
    <d9c>   DW_AT_decl_file   : 6
    <d9d>   DW_AT_decl_line   : 309
    <d9f>   DW_AT_decl_column : 13
    <da0>   DW_AT_type        : <0xb2c>
    <da4>   DW_AT_data_member_location: 544
 <2><da6>: Abbrev Number: 21 (DW_TAG_member)
    <da7>   DW_AT_name        : (indirect string, offset: 0x9ad1f): sFilterRegister
    <dab>   DW_AT_decl_file   : 6
    <dac>   DW_AT_decl_line   : 310
    <dae>   DW_AT_decl_column : 30
    <daf>   DW_AT_type        : <0xdf6>
    <db3>   DW_AT_data_member_location: 576
 <2><db5>: Abbrev Number: 0
 <1><db6>: Abbrev Number: 10 (DW_TAG_array_type)
    <db7>   DW_AT_type        : <0xb1b>
    <dbb>   DW_AT_sibling     : <0xdc6>
 <2><dbf>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <dc0>   DW_AT_type        : <0xae6>
    <dc4>   DW_AT_upper_bound : 87
 <2><dc5>: Abbrev Number: 0
 <1><dc6>: Abbrev Number: 10 (DW_TAG_array_type)
    <dc7>   DW_AT_type        : <0xbd8>
    <dcb>   DW_AT_sibling     : <0xdd6>
 <2><dcf>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <dd0>   DW_AT_type        : <0xae6>
    <dd4>   DW_AT_upper_bound : 2
 <2><dd5>: Abbrev Number: 0
 <1><dd6>: Abbrev Number: 10 (DW_TAG_array_type)
    <dd7>   DW_AT_type        : <0xc28>
    <ddb>   DW_AT_sibling     : <0xde6>
 <2><ddf>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <de0>   DW_AT_type        : <0xae6>
    <de4>   DW_AT_upper_bound : 1
 <2><de5>: Abbrev Number: 0
 <1><de6>: Abbrev Number: 10 (DW_TAG_array_type)
    <de7>   DW_AT_type        : <0xb1b>
    <deb>   DW_AT_sibling     : <0xdf6>
 <2><def>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <df0>   DW_AT_type        : <0xae6>
    <df4>   DW_AT_upper_bound : 11
 <2><df5>: Abbrev Number: 0
 <1><df6>: Abbrev Number: 10 (DW_TAG_array_type)
    <df7>   DW_AT_type        : <0xc5c>
    <dfb>   DW_AT_sibling     : <0xe06>
 <2><dff>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <e00>   DW_AT_type        : <0xae6>
    <e04>   DW_AT_upper_bound : 13
 <2><e05>: Abbrev Number: 0
 <1><e06>: Abbrev Number: 17 (DW_TAG_typedef)
    <e07>   DW_AT_name        : (indirect string, offset: 0x9acd2): CAN_TypeDef
    <e0b>   DW_AT_decl_file   : 6
    <e0c>   DW_AT_decl_line   : 311
    <e0e>   DW_AT_decl_column : 3
    <e0f>   DW_AT_type        : <0xc69>
 <1><e13>: Abbrev Number: 18 (DW_TAG_structure_type)
    <e14>   DW_AT_byte_size   : 28
    <e15>   DW_AT_decl_file   : 6
    <e16>   DW_AT_decl_line   : 481
    <e18>   DW_AT_decl_column : 9
    <e19>   DW_AT_sibling     : <0xe80>
 <2><e1d>: Abbrev Number: 19 (DW_TAG_member)
    <e1e>   DW_AT_name        : CRL
    <e22>   DW_AT_decl_file   : 6
    <e23>   DW_AT_decl_line   : 483
    <e25>   DW_AT_decl_column : 17
    <e26>   DW_AT_type        : <0xb27>
    <e2a>   DW_AT_data_member_location: 0
 <2><e2b>: Abbrev Number: 19 (DW_TAG_member)
    <e2c>   DW_AT_name        : CRH
    <e30>   DW_AT_decl_file   : 6
    <e31>   DW_AT_decl_line   : 484
    <e33>   DW_AT_decl_column : 17
    <e34>   DW_AT_type        : <0xb27>
    <e38>   DW_AT_data_member_location: 4
 <2><e39>: Abbrev Number: 19 (DW_TAG_member)
    <e3a>   DW_AT_name        : IDR
    <e3e>   DW_AT_decl_file   : 6
    <e3f>   DW_AT_decl_line   : 485
    <e41>   DW_AT_decl_column : 17
    <e42>   DW_AT_type        : <0xb27>
    <e46>   DW_AT_data_member_location: 8
 <2><e47>: Abbrev Number: 19 (DW_TAG_member)
    <e48>   DW_AT_name        : ODR
    <e4c>   DW_AT_decl_file   : 6
    <e4d>   DW_AT_decl_line   : 486
    <e4f>   DW_AT_decl_column : 17
    <e50>   DW_AT_type        : <0xb27>
    <e54>   DW_AT_data_member_location: 12
 <2><e55>: Abbrev Number: 16 (DW_TAG_member)
    <e56>   DW_AT_name        : (indirect string, offset: 0x22819): BSRR
    <e5a>   DW_AT_decl_file   : 6
    <e5b>   DW_AT_decl_line   : 487
    <e5d>   DW_AT_decl_column : 17
    <e5e>   DW_AT_type        : <0xb27>
    <e62>   DW_AT_data_member_location: 16
 <2><e63>: Abbrev Number: 19 (DW_TAG_member)
    <e64>   DW_AT_name        : BRR
    <e68>   DW_AT_decl_file   : 6
    <e69>   DW_AT_decl_line   : 488
    <e6b>   DW_AT_decl_column : 17
    <e6c>   DW_AT_type        : <0xb27>
    <e70>   DW_AT_data_member_location: 20
 <2><e71>: Abbrev Number: 16 (DW_TAG_member)
    <e72>   DW_AT_name        : (indirect string, offset: 0x84161): LCKR
    <e76>   DW_AT_decl_file   : 6
    <e77>   DW_AT_decl_line   : 489
    <e79>   DW_AT_decl_column : 17
    <e7a>   DW_AT_type        : <0xb27>
    <e7e>   DW_AT_data_member_location: 24
 <2><e7f>: Abbrev Number: 0
 <1><e80>: Abbrev Number: 17 (DW_TAG_typedef)
    <e81>   DW_AT_name        : (indirect string, offset: 0x950bf): GPIO_TypeDef
    <e85>   DW_AT_decl_file   : 6
    <e86>   DW_AT_decl_line   : 490
    <e88>   DW_AT_decl_column : 3
    <e89>   DW_AT_type        : <0xe13>
 <1><e8d>: Abbrev Number: 18 (DW_TAG_structure_type)
    <e8e>   DW_AT_byte_size   : 40
    <e8f>   DW_AT_decl_file   : 6
    <e90>   DW_AT_decl_line   : 547
    <e92>   DW_AT_decl_column : 9
    <e93>   DW_AT_sibling     : <0xf23>
 <2><e97>: Abbrev Number: 19 (DW_TAG_member)
    <e98>   DW_AT_name        : CR
    <e9b>   DW_AT_decl_file   : 6
    <e9c>   DW_AT_decl_line   : 549
    <e9e>   DW_AT_decl_column : 17
    <e9f>   DW_AT_type        : <0xb27>
    <ea3>   DW_AT_data_member_location: 0
 <2><ea4>: Abbrev Number: 16 (DW_TAG_member)
    <ea5>   DW_AT_name        : (indirect string, offset: 0x5d957): CFGR
    <ea9>   DW_AT_decl_file   : 6
    <eaa>   DW_AT_decl_line   : 550
    <eac>   DW_AT_decl_column : 17
    <ead>   DW_AT_type        : <0xb27>
    <eb1>   DW_AT_data_member_location: 4
 <2><eb2>: Abbrev Number: 19 (DW_TAG_member)
    <eb3>   DW_AT_name        : CIR
    <eb7>   DW_AT_decl_file   : 6
    <eb8>   DW_AT_decl_line   : 551
    <eba>   DW_AT_decl_column : 17
    <ebb>   DW_AT_type        : <0xb27>
    <ebf>   DW_AT_data_member_location: 8
 <2><ec0>: Abbrev Number: 16 (DW_TAG_member)
    <ec1>   DW_AT_name        : (indirect string, offset: 0x43321): APB2RSTR
    <ec5>   DW_AT_decl_file   : 6
    <ec6>   DW_AT_decl_line   : 552
    <ec8>   DW_AT_decl_column : 17
    <ec9>   DW_AT_type        : <0xb27>
    <ecd>   DW_AT_data_member_location: 12
 <2><ece>: Abbrev Number: 16 (DW_TAG_member)
    <ecf>   DW_AT_name        : (indirect string, offset: 0x11ad1): APB1RSTR
    <ed3>   DW_AT_decl_file   : 6
    <ed4>   DW_AT_decl_line   : 553
    <ed6>   DW_AT_decl_column : 17
    <ed7>   DW_AT_type        : <0xb27>
    <edb>   DW_AT_data_member_location: 16
 <2><edc>: Abbrev Number: 16 (DW_TAG_member)
    <edd>   DW_AT_name        : (indirect string, offset: 0xe360): AHBENR
    <ee1>   DW_AT_decl_file   : 6
    <ee2>   DW_AT_decl_line   : 554
    <ee4>   DW_AT_decl_column : 17
    <ee5>   DW_AT_type        : <0xb27>
    <ee9>   DW_AT_data_member_location: 20
 <2><eea>: Abbrev Number: 16 (DW_TAG_member)
    <eeb>   DW_AT_name        : (indirect string, offset: 0x126d2): APB2ENR
    <eef>   DW_AT_decl_file   : 6
    <ef0>   DW_AT_decl_line   : 555
    <ef2>   DW_AT_decl_column : 17
    <ef3>   DW_AT_type        : <0xb27>
    <ef7>   DW_AT_data_member_location: 24
 <2><ef8>: Abbrev Number: 16 (DW_TAG_member)
    <ef9>   DW_AT_name        : (indirect string, offset: 0x740b8): APB1ENR
    <efd>   DW_AT_decl_file   : 6
    <efe>   DW_AT_decl_line   : 556
    <f00>   DW_AT_decl_column : 17
    <f01>   DW_AT_type        : <0xb27>
    <f05>   DW_AT_data_member_location: 28
 <2><f06>: Abbrev Number: 16 (DW_TAG_member)
    <f07>   DW_AT_name        : (indirect string, offset: 0x154f8): BDCR
    <f0b>   DW_AT_decl_file   : 6
    <f0c>   DW_AT_decl_line   : 557
    <f0e>   DW_AT_decl_column : 17
    <f0f>   DW_AT_type        : <0xb27>
    <f13>   DW_AT_data_member_location: 32
 <2><f14>: Abbrev Number: 19 (DW_TAG_member)
    <f15>   DW_AT_name        : CSR
    <f19>   DW_AT_decl_file   : 6
    <f1a>   DW_AT_decl_line   : 558
    <f1c>   DW_AT_decl_column : 17
    <f1d>   DW_AT_type        : <0xb27>
    <f21>   DW_AT_data_member_location: 36
 <2><f22>: Abbrev Number: 0
 <1><f23>: Abbrev Number: 17 (DW_TAG_typedef)
    <f24>   DW_AT_name        : (indirect string, offset: 0x47983): RCC_TypeDef
    <f28>   DW_AT_decl_file   : 6
    <f29>   DW_AT_decl_line   : 561
    <f2b>   DW_AT_decl_column : 3
    <f2c>   DW_AT_type        : <0xe8d>
 <1><f30>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <f31>   DW_AT_encoding    : 7	(unsigned)
    <f32>   DW_AT_byte_size   : 1
    <f33>   DW_AT_type        : <0xa8a>
    <f37>   DW_AT_decl_file   : 7
    <f38>   DW_AT_decl_line   : 158
    <f39>   DW_AT_decl_column : 1
    <f3a>   DW_AT_sibling     : <0xf4b>
 <2><f3e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f3f>   DW_AT_name        : (indirect string, offset: 0x49073): DISABLE
    <f43>   DW_AT_const_value : 0
 <2><f44>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f45>   DW_AT_name        : (indirect string, offset: 0x8bdf4): ENABLE
    <f49>   DW_AT_const_value : 1
 <2><f4a>: Abbrev Number: 0
 <1><f4b>: Abbrev Number: 6 (DW_TAG_typedef)
    <f4c>   DW_AT_name        : (indirect string, offset: 0x98c8a): FunctionalState
    <f50>   DW_AT_decl_file   : 7
    <f51>   DW_AT_decl_line   : 161
    <f52>   DW_AT_decl_column : 3
    <f53>   DW_AT_type        : <0xf30>
 <1><f57>: Abbrev Number: 5 (DW_TAG_base_type)
    <f58>   DW_AT_byte_size   : 8
    <f59>   DW_AT_encoding    : 4	(float)
    <f5a>   DW_AT_name        : (indirect string, offset: 0xa0bd9): long double
 <1><f5e>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <f5f>   DW_AT_encoding    : 7	(unsigned)
    <f60>   DW_AT_byte_size   : 1
    <f61>   DW_AT_type        : <0xa8a>
    <f65>   DW_AT_decl_file   : 8
    <f66>   DW_AT_decl_line   : 40
    <f67>   DW_AT_decl_column : 1
    <f68>   DW_AT_sibling     : <0xf85>
 <2><f6c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f6d>   DW_AT_name        : (indirect string, offset: 0x344a7): HAL_OK
    <f71>   DW_AT_const_value : 0
 <2><f72>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f73>   DW_AT_name        : (indirect string, offset: 0x603c9): HAL_ERROR
    <f77>   DW_AT_const_value : 1
 <2><f78>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f79>   DW_AT_name        : (indirect string, offset: 0x1ab9a): HAL_BUSY
    <f7d>   DW_AT_const_value : 2
 <2><f7e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f7f>   DW_AT_name        : (indirect string, offset: 0x2d1cd): HAL_TIMEOUT
    <f83>   DW_AT_const_value : 3
 <2><f84>: Abbrev Number: 0
 <1><f85>: Abbrev Number: 14 (DW_TAG_structure_type)
    <f86>   DW_AT_byte_size   : 16
    <f87>   DW_AT_decl_file   : 9
    <f88>   DW_AT_decl_line   : 47
    <f89>   DW_AT_decl_column : 9
    <f8a>   DW_AT_sibling     : <0xfc3>
 <2><f8e>: Abbrev Number: 15 (DW_TAG_member)
    <f8f>   DW_AT_name        : Pin
    <f93>   DW_AT_decl_file   : 9
    <f94>   DW_AT_decl_line   : 49
    <f95>   DW_AT_decl_column : 12
    <f96>   DW_AT_type        : <0xb1b>
    <f9a>   DW_AT_data_member_location: 0
 <2><f9b>: Abbrev Number: 23 (DW_TAG_member)
    <f9c>   DW_AT_name        : (indirect string, offset: 0xafbbc): Mode
    <fa0>   DW_AT_decl_file   : 9
    <fa1>   DW_AT_decl_line   : 52
    <fa2>   DW_AT_decl_column : 12
    <fa3>   DW_AT_type        : <0xb1b>
    <fa7>   DW_AT_data_member_location: 4
 <2><fa8>: Abbrev Number: 23 (DW_TAG_member)
    <fa9>   DW_AT_name        : (indirect string, offset: 0x340b): Pull
    <fad>   DW_AT_decl_file   : 9
    <fae>   DW_AT_decl_line   : 55
    <faf>   DW_AT_decl_column : 12
    <fb0>   DW_AT_type        : <0xb1b>
    <fb4>   DW_AT_data_member_location: 8
 <2><fb5>: Abbrev Number: 23 (DW_TAG_member)
    <fb6>   DW_AT_name        : (indirect string, offset: 0x5a253): Speed
    <fba>   DW_AT_decl_file   : 9
    <fbb>   DW_AT_decl_line   : 58
    <fbc>   DW_AT_decl_column : 12
    <fbd>   DW_AT_type        : <0xb1b>
    <fc1>   DW_AT_data_member_location: 12
 <2><fc2>: Abbrev Number: 0
 <1><fc3>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc4>   DW_AT_name        : (indirect string, offset: 0x8da46): GPIO_InitTypeDef
    <fc8>   DW_AT_decl_file   : 9
    <fc9>   DW_AT_decl_line   : 60
    <fca>   DW_AT_decl_column : 3
    <fcb>   DW_AT_type        : <0xf85>
 <1><fcf>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <fd0>   DW_AT_encoding    : 7	(unsigned)
    <fd1>   DW_AT_byte_size   : 1
    <fd2>   DW_AT_type        : <0xa8a>
    <fd6>   DW_AT_decl_file   : 10
    <fd7>   DW_AT_decl_line   : 48
    <fd8>   DW_AT_decl_column : 1
    <fd9>   DW_AT_sibling     : <0x1002>
 <2><fdd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fde>   DW_AT_name        : (indirect string, offset: 0x9ab90): HAL_CAN_STATE_RESET
    <fe2>   DW_AT_const_value : 0
 <2><fe3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fe4>   DW_AT_name        : (indirect string, offset: 0x9a948): HAL_CAN_STATE_READY
    <fe8>   DW_AT_const_value : 1
 <2><fe9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fea>   DW_AT_name        : (indirect string, offset: 0x9aac4): HAL_CAN_STATE_LISTENING
    <fee>   DW_AT_const_value : 2
 <2><fef>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ff0>   DW_AT_name        : (indirect string, offset: 0x9ad03): HAL_CAN_STATE_SLEEP_PENDING
    <ff4>   DW_AT_const_value : 3
 <2><ff5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ff6>   DW_AT_name        : (indirect string, offset: 0x9a83e): HAL_CAN_STATE_SLEEP_ACTIVE
    <ffa>   DW_AT_const_value : 4
 <2><ffb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ffc>   DW_AT_name        : (indirect string, offset: 0x9ac3a): HAL_CAN_STATE_ERROR
    <1000>   DW_AT_const_value : 5
 <2><1001>: Abbrev Number: 0
 <1><1002>: Abbrev Number: 6 (DW_TAG_typedef)
    <1003>   DW_AT_name        : (indirect string, offset: 0x9a933): HAL_CAN_StateTypeDef
    <1007>   DW_AT_decl_file   : 10
    <1008>   DW_AT_decl_line   : 56
    <1009>   DW_AT_decl_column : 3
    <100a>   DW_AT_type        : <0xfcf>
 <1><100e>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <100f>   DW_AT_type        : <0x1002>
 <1><1013>: Abbrev Number: 14 (DW_TAG_structure_type)
    <1014>   DW_AT_byte_size   : 28
    <1015>   DW_AT_decl_file   : 10
    <1016>   DW_AT_decl_line   : 61
    <1017>   DW_AT_decl_column : 9
    <1018>   DW_AT_sibling     : <0x10ac>
 <2><101c>: Abbrev Number: 23 (DW_TAG_member)
    <101d>   DW_AT_name        : (indirect string, offset: 0xafcd3): Prescaler
    <1021>   DW_AT_decl_file   : 10
    <1022>   DW_AT_decl_line   : 63
    <1023>   DW_AT_decl_column : 12
    <1024>   DW_AT_type        : <0xb1b>
    <1028>   DW_AT_data_member_location: 0
 <2><1029>: Abbrev Number: 23 (DW_TAG_member)
    <102a>   DW_AT_name        : (indirect string, offset: 0xafbbc): Mode
    <102e>   DW_AT_decl_file   : 10
    <102f>   DW_AT_decl_line   : 66
    <1030>   DW_AT_decl_column : 12
    <1031>   DW_AT_type        : <0xb1b>
    <1035>   DW_AT_data_member_location: 4
 <2><1036>: Abbrev Number: 23 (DW_TAG_member)
    <1037>   DW_AT_name        : (indirect string, offset: 0x9a8f3): SyncJumpWidth
    <103b>   DW_AT_decl_file   : 10
    <103c>   DW_AT_decl_line   : 69
    <103d>   DW_AT_decl_column : 12
    <103e>   DW_AT_type        : <0xb1b>
    <1042>   DW_AT_data_member_location: 8
 <2><1043>: Abbrev Number: 23 (DW_TAG_member)
    <1044>   DW_AT_name        : (indirect string, offset: 0x9aa47): TimeSeg1
    <1048>   DW_AT_decl_file   : 10
    <1049>   DW_AT_decl_line   : 73
    <104a>   DW_AT_decl_column : 12
    <104b>   DW_AT_type        : <0xb1b>
    <104f>   DW_AT_data_member_location: 12
 <2><1050>: Abbrev Number: 23 (DW_TAG_member)
    <1051>   DW_AT_name        : (indirect string, offset: 0x9aa50): TimeSeg2
    <1055>   DW_AT_decl_file   : 10
    <1056>   DW_AT_decl_line   : 76
    <1057>   DW_AT_decl_column : 12
    <1058>   DW_AT_type        : <0xb1b>
    <105c>   DW_AT_data_member_location: 16
 <2><105d>: Abbrev Number: 23 (DW_TAG_member)
    <105e>   DW_AT_name        : (indirect string, offset: 0x9a869): TimeTriggeredMode
    <1062>   DW_AT_decl_file   : 10
    <1063>   DW_AT_decl_line   : 79
    <1064>   DW_AT_decl_column : 19
    <1065>   DW_AT_type        : <0xf4b>
    <1069>   DW_AT_data_member_location: 20
 <2><106a>: Abbrev Number: 23 (DW_TAG_member)
    <106b>   DW_AT_name        : (indirect string, offset: 0x9abb2): AutoBusOff
    <106f>   DW_AT_decl_file   : 10
    <1070>   DW_AT_decl_line   : 82
    <1071>   DW_AT_decl_column : 19
    <1072>   DW_AT_type        : <0xf4b>
    <1076>   DW_AT_data_member_location: 21
 <2><1077>: Abbrev Number: 23 (DW_TAG_member)
    <1078>   DW_AT_name        : (indirect string, offset: 0x9acc2): AutoWakeUp
    <107c>   DW_AT_decl_file   : 10
    <107d>   DW_AT_decl_line   : 85
    <107e>   DW_AT_decl_column : 19
    <107f>   DW_AT_type        : <0xf4b>
    <1083>   DW_AT_data_member_location: 22
 <2><1084>: Abbrev Number: 23 (DW_TAG_member)
    <1085>   DW_AT_name        : (indirect string, offset: 0x9ad8e): AutoRetransmission
    <1089>   DW_AT_decl_file   : 10
    <108a>   DW_AT_decl_line   : 88
    <108b>   DW_AT_decl_column : 19
    <108c>   DW_AT_type        : <0xf4b>
    <1090>   DW_AT_data_member_location: 23
 <2><1091>: Abbrev Number: 23 (DW_TAG_member)
    <1092>   DW_AT_name        : (indirect string, offset: 0x9a9b9): ReceiveFifoLocked
    <1096>   DW_AT_decl_file   : 10
    <1097>   DW_AT_decl_line   : 91
    <1098>   DW_AT_decl_column : 19
    <1099>   DW_AT_type        : <0xf4b>
    <109d>   DW_AT_data_member_location: 24
 <2><109e>: Abbrev Number: 23 (DW_TAG_member)
    <109f>   DW_AT_name        : (indirect string, offset: 0x9ac0e): TransmitFifoPriority
    <10a3>   DW_AT_decl_file   : 10
    <10a4>   DW_AT_decl_line   : 94
    <10a5>   DW_AT_decl_column : 19
    <10a6>   DW_AT_type        : <0xf4b>
    <10aa>   DW_AT_data_member_location: 25
 <2><10ab>: Abbrev Number: 0
 <1><10ac>: Abbrev Number: 6 (DW_TAG_typedef)
    <10ad>   DW_AT_name        : (indirect string, offset: 0x9a923): CAN_InitTypeDef
    <10b1>   DW_AT_decl_file   : 10
    <10b2>   DW_AT_decl_line   : 97
    <10b3>   DW_AT_decl_column : 3
    <10b4>   DW_AT_type        : <0x1013>
 <1><10b8>: Abbrev Number: 24 (DW_TAG_structure_type)
    <10b9>   DW_AT_name        : (indirect string, offset: 0x9aa63): __CAN_HandleTypeDef
    <10bd>   DW_AT_byte_size   : 40
    <10be>   DW_AT_decl_file   : 10
    <10bf>   DW_AT_decl_line   : 209
    <10c0>   DW_AT_decl_column : 16
    <10c1>   DW_AT_sibling     : <0x10fa>
 <2><10c5>: Abbrev Number: 23 (DW_TAG_member)
    <10c6>   DW_AT_name        : (indirect string, offset: 0x3bfd3): Instance
    <10ca>   DW_AT_decl_file   : 10
    <10cb>   DW_AT_decl_line   : 211
    <10cc>   DW_AT_decl_column : 32
    <10cd>   DW_AT_type        : <0x10fa>
    <10d1>   DW_AT_data_member_location: 0
 <2><10d2>: Abbrev Number: 23 (DW_TAG_member)
    <10d3>   DW_AT_name        : (indirect string, offset: 0x2bb89): Init
    <10d7>   DW_AT_decl_file   : 10
    <10d8>   DW_AT_decl_line   : 213
    <10d9>   DW_AT_decl_column : 31
    <10da>   DW_AT_type        : <0x10ac>
    <10de>   DW_AT_data_member_location: 4
 <2><10df>: Abbrev Number: 23 (DW_TAG_member)
    <10e0>   DW_AT_name        : (indirect string, offset: 0xac535): State
    <10e4>   DW_AT_decl_file   : 10
    <10e5>   DW_AT_decl_line   : 215
